{
    "shrek": {
        "name": "Shrek",
        "year": 2001,
        "top_cast": [
            {
                "name": "Mike Myers",
                "characters": [
                    "Shrek",
                    "Blind Mouse",
                    "Opening Narration"
                ]
            },
            {
                "name": "Eddie Murphy",
                "characters": [
                    "Donkey"
                ]
            },
            {
                "name": "Cameron Diaz",
                "characters": [
                    "Princess Fiona"
                ]
            },
            {
                "name": "John Lithgow",
                "characters": [
                    "Lord Farquaad"
                ]
            },
            {
                "name": "Vincent Cassel",
                "characters": [
                    "Monsieur Hood"
                ]
            },
            {
                "name": "Peter Dennis",
                "characters": [
                    "Ogre Hunter"
                ]
            },
            {
                "name": "Clive Pearse",
                "characters": [
                    "Ogre Hunter"
                ]
            },
            {
                "name": "Jim Cummings",
                "characters": [
                    "Captain of Guards"
                ]
            },
            {
                "name": "Bobby Block",
                "characters": [
                    "Baby Bear"
                ]
            },
            {
                "name": "Chris Miller",
                "characters": [
                    "Geppetto",
                    "Magic Mirror"
                ]
            },
            {
                "name": "Cody Cameron",
                "characters": [
                    "Pinnochio",
                    "Three Pigs"
                ]
            },
            {
                "name": "Kathleen Freeman",
                "characters": [
                    "Old Woman"
                ]
            },
            {
                "name": "Michael Galasso",
                "characters": [
                    "Peter Pan"
                ]
            },
            {
                "name": "Christopher Knights",
                "characters": [
                    "Blind Mouse",
                    "Thelonious"
                ]
            },
            {
                "name": "Simon J. Smith",
                "characters": [
                    "Blind Mouse"
                ]
            },
            {
                "name": "Conrad Vernon",
                "characters": [
                    "Gingerbread Man"
                ]
            },
            {
                "name": "Jacquie Barnbrook",
                "characters": [
                    "Wrestling Fan"
                ]
            },
            {
                "name": "Guillaume Aretos",
                "characters": [
                    "Merry Man"
                ]
            },
            {
                "name": "John Bisom",
                "characters": [
                    "Merry Man"
                ]
            },
            {
                "name": "Matthew Gonder",
                "characters": [
                    "Merry Man"
                ]
            },
            {
                "name": "Calvin Remsberg",
                "characters": [
                    "Merry Man"
                ]
            },
            {
                "name": "Jean-Paul Vignon",
                "characters": [
                    "Merry Man"
                ]
            },
            {
                "name": "Val Bettin",
                "characters": [
                    "Bishop"
                ]
            }
        ],
        "quotes": [
            "[Shrek enters the tournament]\nLord Farquaad: What's that? It's hideous!\nShrek: Well, that's not very nice.\n[gestures to Donkey]\nShrek: It's just a donkey.",
            "Donkey: We can stay up late, swapping manly stories, and in the morning, I'm making waffles!",
            "Princess Fiona: Where are you going? The exit's over there!\nShrek: [going to save Donkey] Well, I have to save my ass.\nPrincess Fiona: [shocked] What kind of knight ARE you?\nShrek: One of a kind.",
            "[looking for a certain type of flower]\nDonkey: Blue flower, red thorns. Blue flower, red thorns. Blue flower, red thorns. Man, this would be so much easier if I wasn't COLOR-BLIND!",
            "Donkey: [looks at a hovel] Whoa, look at that. Who'd wanna live in a place like that?\nShrek: 'That' would be my home.\nDonkey: Oh... and it is LOVELY! You know, you're really quite a decorator. It's amazing what you've done with such a modest budget. I like that boulder. That is a NICE boulder.",
            "Shrek: For your information, there's a lot more to ogres than people think.\nDonkey: Example?\nShrek: Example... uh... ogres are like onions!\n[holds up an onion, which Donkey sniffs]\nDonkey: They stink?\nShrek: Yes... No!\nDonkey: Oh, they make you cry?\nShrek: No!\nDonkey: Oh, you leave 'em out in the sun, they get all brown, start sproutin' little white hairs...\nShrek: [peels an onion] NO! Layers. Onions have layers. Ogres have layers... You get it? We both have layers.\n[walks off]\nDonkey: Oh, you both have LAYERS. Oh. You know, not everybody like onions. CAKE! Everybody loves cake! Cakes have layers!\nShrek: I don't care what everyone likes! Ogres are not like cakes.\nDonkey: You know what ELSE everybody likes? Parfaits! Have you ever met a person, you say, \"Let's get some parfait,\" they say, \"Hell no, I don't like no parfait.\"? Parfaits are delicious!\nShrek: NO! You dense, irritating, miniature beast of burden! Ogres are like onions! End of story! Bye-bye! See ya later.\nDonkey: Parfait's may be the most delicious thing on the whole damn planet!",
            "Donkey: Hi, Princess!\nPrincess Fiona: It talks!\nShrek: Yeah, it's getting him to shut up that's the trick!",
            "Donkey: Hey, what's your problem, Shrek, what you got against the whole world anyway, huh?\nShrek: Look, I'm not the one with the problem, okay? It's the world that seems to have a problem with ME! People take one look at me and go \"Aargh! Help! Run! A big stupid ugly ogre!\" They judge me before they even know me - that's why I'm better off alone...\nDonkey: You know, Shrek... when we first met, I didn't think you were a big, stupid, ugly ogre.\nShrek: Yeah, I know.",
            "[Shrek, his swamp filled with fairytale creatures, glares at Donkey]\nDonkey: Hey, don't look at me, I didn't invite them!\nPinocchio: Oh, gosh, no one invited us!\nShrek: What?\nPinocchio: We were forced to come here!\nShrek: By who?\nLittle Pig: Lord Farquaad. He huffed, and he puffed... and he signed an eviction notice.",
            "Shrek: Donkey, two things okay? Shut... up!",
            "Donkey: So where is this fire-breathin' pain in the neck, anyway?\nShrek: Inside, waiting for us to rescue her.\nDonkey: I was talkin' about the dragon, Shrek.",
            "[arriving at Duloc]\nShrek: [observing a giant building] That must be Lord Farquaad's castle... Do you think he's maybe compensating for something?",
            "[Donkey thinks he's dying]\nThe Donkey: Hey, where're you going? Oh man, I can't feel my toes!\n[Looks down and yelps]\nThe Donkey: I don't have any toes!\n[sits down]\nThe Donkey: I think I need a hug.",
            "Lord Farquaad: [playing with Gingy's legs] Run, run, run as fast as you can / You can't catch me, I'm the Gingerbread Man!\nGingerbread Man: You're a monster!\nLord Farquaad: [tossing legs away] I'm not the monster here, YOU are! You and the rest of that fairytale trash, poisoning my perfect world. Now tell me, where are the others?\nGingerbread Man: Eat me!\n[spits in Farquaad's face]\nLord Farquaad: I've tried to be fair to you creatures, but now my patience has reached its end! Tell me, or I'll...\n[reaches down]\nGingerbread Man: NO! Not the buttons! Not my gumdrop buttons!\nLord Farquaad: All right, then! Who's hiding them?\nGingerbread Man: Okay, I'll tell you... Do you know... the Muffin Man?\nLord Farquaad: The Muffin Man?\nGingerbread Man: The Muffin Man.\nLord Farquaad: Yes, I know the Muffin Man. W-who lives on Drury Lane?\nGingerbread Man: Well, she's married to the Muffin Man...\nLord Farquaad: The Muffin Man?\nGingerbread Man: THE MUFFIN MAN!\nLord Farquaad: She's married to the Muffin Man...",
            "Shrek: Listen, little donkey, take a look at me! What am I?\nDonkey: Ah... really tall?\nShrek: No! I'm an OGRE! You know, \"grab your torch and pitchforks!\" Doesn't that bother you?\nDonkey: Nope.\nShrek: Really?\nDonkey: Really, really.\nShrek: [taken aback] Oh.\nDonkey: Man, I like you. What's your name?\nShrek: Er... Shrek.",
            "Princess Fiona: The sooner we get to Duloc, the better!\nDonkey: Oh, you gonna love it there, Princess, it's beautiful!\nPrincess Fiona: And my groom-to-be Lord Farquaad, what's he like?\nShrek: Well, let me put it this way, Princess: men of his stature are in SHORT supply.\n[chortles]\nDonkey: Yeah! Though there are those who think LITTLE of him!\n[laughs]",
            "Helpful\n•\n43\n\n1\n\nPrincess Fiona: [hears a roar] You didn't slay the dragon?\nShrek: It's on my to-do list, now come on!\nPrincess Fiona: But this isn't right! You're meant to charge in, sword drawn, banners flying! That's what all the other knights did!\nShrek: Yeah, right before they burst into flame!\n[They pass a skeleton of one of the unfortunate victims]\nPrincess Fiona: That's not the point...!",
            "[the dragon has eaten Lord Farquaad and spits out his crown]\nDonkey: Huh, celebrity marriages. They never last, do they?\n[receives applause from the crowd]\nDonkey: Good evening, people.",
            "Captain of Guards: [as Donkey flies through the air on pixie dust] He can talk!\nDonkey: That's right, fool! Now I'm a flying talking donkey! You might have seen a housefly, maybe even a superfly, but I bet you ain't never seen a donkeyfly! Ha, ha!\n[pixie dust wears off]\nDonkey: Uh-oh!",
            "Shrek: That'll do, Donkey. That'll do.",
            "[Donkey keeps humming the \"Duloc\" song]\nShrek: All right, you're going the right way for a smacked bottom.\nDonkey: Sorry 'bout that.",
            "Lord Farquaad: [to his knights] The winner of this tournament - no, no, the privilege - will have the honour of rescuing the beautiful Princess Fiona from the fiery pit of that dragon! Should the winner fail to return, the runner-up shall take his place, and so on and so forth... Some of you may die, but it's a sacrifice I am willing to make.",
            "Donkey: You're so wrapped up in layers onion boy, you're afraid of your own feelings!\nShrek: [hiding in the toilet] Go away!\nDonkey: See? There you are, doing it again! Just like you did to Fiona! All she ever did was like you maybe, even love you!\nShrek: LOVE me? She said I was ugly, a hideous creature! I heard the two of you talking!\nDonkey: She wasn't talking about you, okay? She was talking about... uh... somebody else.\nShrek: [comes out] She... wasn't... talking about me?",
            "[Shrek has been hit by an arrow]\nPrincess Fiona: Oh!... oh, this is all my fault...\nDonkey: Why, what's wrong?\nPrincess Fiona: Shrek's hurt!\nDonkey: Shrek's hurt? Shrek's HURT? Oh, no, Shrek's gonna die!\nShrek: Donkey, I'm okay!\nDonkey: You can't do this to me, Shrek, I'm too young for you to die! Keep your feet elevated! Turn your head and cough! Does anybody know the Heimlich...?\nPrincess Fiona: [grabs Donkey] Donkey, calm down! If you want to help Shrek, go into the forest and look for a blue flower with red thorns.\nDonkey: Blue flower, red thorns! Okay, I got it! Blue flower, red thorns! Blue flower, red thorns! Don't die, Shrek, and if you see any long tunnels, stay away from the light!\nShrek: DONKEY!\nDonkey: Okay, okay. Blue flower, red thorns! Blue flower, red thorns!\n[runs off]\nShrek: What're the flowers for?\nPrincess Fiona: For getting rid of Donkey.",
            "[as they approach Fiona's castle, Donkey smells the air]\nDonkey: Woah, Shrek, did you do that? Man, you gotta warn somebody before you just crack one off, my mouth was open and everything!\nShrek: Believe me, Donkey, if it was me, you'd be dead!\n[sniffs]\nShrek: It's brimstone. We must be getting close.\nDonkey: Yeah, right, brimstone. Don't be talking about \"it's the brimstone\". I know what I smelled and it wasn't no brimstone and it didn't come off no stone neither.",
            "Princess Fiona: [as ogre] Donkey, shh, shh. It's me... in this body.\nDonkey: [gasps] Oh, my God, you ate the princess!",
            "Merry Men: [singing] Ta da, da da da da - whoo!\nMonsieur Hood: I steal from the rich and give to the needy...\nMerry Man: He takes a wee percentage...\nMonsieur Hood: But I'm not greedy - I rescue pretty damsels, man I'm good!\nMerry Men: What a guy, ha ha, Monsieur Hood!\nMonsieur Hood: Break it down...\n[Merry Men Irish step dance]\nMonsieur Hood: I like an honest fight and a saucy little maid...\nMerry Men: What he's basically saying is he likes to get...\nMonsieur Hood: Paid!\nMonsieur Hood: So, when an ogre in the bush grabs a lady by the tush, that's bad.\nMerry Man: [joining in] That's bad, that's bad, that's bad!\nMonsieur Hood: When a beauty's with a beast it makes me awfully mad!\nMerry Men: He's mad, he's really, really mad!\nMonsieur Hood: Now I'll take my blade and ram it through your heart Keep your eyes on me, boys, 'Cause I'm about to start...\n[Fiona swoops in and kicks him - the music stops]\nPrincess Fiona: Man, that was annoying!",
            "Magic Mirror: [telling Lord Farquaad about his bachelorettes] So, just sit back and relax, my Lord, because I'm about to give you today's three eligible bachelorettes.\n[the mirror shows images of Cinderella]\nMagic Mirror: Our first bachelorette is a mentally abused shut-in from a kingdom far, far away. She likes sushi and hot-tubbing any time. Her hobbies include cooking and cleaning for her two evil sisters. Let's hear it for Cinderella!\n[changes to images of Snow White]\nMagic Mirror: Bachelorette number two is a cape-wearing girl from the Land of Fantasy. Although she lives with seven other men, she's not easy. Just kiss her frozen, dead lips and find out what a live wire she is. Give it up for Snow White!\n[changes to Princess Fiona]\nMagic Mirror: And last but not least is a fiery redhead who lives in a dragon-guarded castle surrounded by a boiling lake of lava! But don't let that cool you off. She's a loaded pistol who likes piña coladas and getting caught in the rain. Yours for the rescuing: Princess Fiona! So, who will it be? Bachelorette #1? Bechelorette #2? Or Bachelorette #3?\n[Farquaad's advisors start calling out their choices, with Thelonious saying \"#3\"]\nLord Farquaad: Uhhh, Number 3!\nMagic Mirror: Lord Farquaad, you have chosen... Princess Fiona.",
            "Donkey: I'll find those stairs. I'll whip their butt, too. Those stairs won't know which way they're going... take drastic steps, kick it to the curb. Don't mess wit' me. I'm the Stair Master. I've mastered the stairs. I wish I had a step right here, right now, I'd step all over it...",
            "Shrek: Princess, I was SENT to rescue you by Lord Farquad, okay? HE's the one that wants to marry you.\nPrincess Fiona: Well, why didn't he come to rescue me?\nShrek: Good question! You can ask him that when we get there...\nPrincess Fiona: But I'm supposed to be rescued by my true love, not by some ogre a-a-and his PET!\nDonkey: Well, so much for noble steed!\nShrek: Look, Princess, you're not making my job any easier...\nPrincess Fiona: Well, I'm sorry, but your job is not my problem. You tell Lord \"Far-Quad\" that if he wants to rescue me PROPERLY, I'll be waiting for him right here!\n[sits down]\nShrek: Hey! I'm nobody's messenger boy, all right? I'm a delivery boy!\nPrincess Fiona: You wouldn't dare...!\n[Shrek carries her off]\nShrek: You coming, Donkey?\nDonkey: Yeah, I'm right behind you.",
            "Donkey: Shrek! Hold up, Shrek! You got to wait for the line!\nShrek: [about to burst into the cathedral] What are you talking about?\nDonkey: The line, the line you gotta wait for: the priest's gonna say \"Speak now or forever hold your piece\", and you rush in and say \"I object!\"\nShrek: I don't have time for all that!\n[runs forward]\nDonkey: [stops Shrek] You love this woman, don't ya?\nShrek: Yes.\nDonkey: Do you wanna hold her?\nShrek: Yes!\nDonkey: Please her?\nShrek: YES!\nDonkey: Then ya gotta, gotta try a little TENDERNESS! Chicks love that romantic crap!\nShrek: All right, cut it out! When does this guy say the line?\nDonkey: ...We gotta check that out.",
            "[Dragon, having a crush on Donkey, is cuddling him]\nDonkey: [desperately talking] I don't want to rush into a... physical relationship... I'm not that emotionally ready for a... uh... commitment of this... uh... magnitude! Really, that's the word I'm looking for, magnitude... Huh! Hey, that is unwanted physical contact! Hey! What're you doing? Okay, okay, okay... let's just back up a little and take this one step at a time... I mean, we should really get to know each other first, you know, as friends or maybe even as pen pals, you know, coz I'm on the road a lot, but I just love to get a card... Hey, hey, hey, don't do that, that's my TAIL, that's my personal tail, you gonna tear it off! I don't give permission to... Hey, what're you gonna do with that? Oh, no, no, no, no... no!",
            "[first lines]\n[a fairytale book appears]\nShrek: [narrating] Once upon a time, there was a lovely princess. But she had an enchantment upon her of a fearful sort, which could only be broken by love's first kiss. She was locked away in a castle guarded by a terrible fire-breathing dragon. Many brave knights had attempted to free her from this dreadful prison, but none prevailed. She waited in the dragon's keep, in the highest room of the tallest tower, for her true love, and true love's first kiss.\n[tears out a page from the book and shuts it]\nShrek: [laughs] Like THAT's ever gonna happen! What a load of...\n[flushes toilet and comes out of the outhouse]",
            "Shrek: [to Donkey] WHY are you following me?\nDonkey: Oh, I'll tell you why.\n[starts to sing]\nDonkey: 'Cause I'm all alone / There's no one here beside me / My problems have all gone / There's no one to deride me! / But ya gotta have friends...\nShrek: STOP SINGING! Well, it's no wonder you don't have any friends!\nDonkey: Wow! Only a TRUE friend would be that cruelly honest!",
            "Lord Farquaad: Mirror, mirror, on the wall - is this not the most perfect kingdom of them all?\nMagic Mirror: Well, technically, you're not a king.\nLord Farquaad: Ah, Thelonius?\n[Thelonius the Executioner holds up a small mirror and smashes it]\nLord Farquaad: You were saying?\nMagic Mirror: [nervous] What I mean is, er, you're not a king YET! Heh, but-but you can become one! All you have to do is marry a princess.\nLord Farquaad: Go on...",
            "Princess Fiona: [after Shrek and Donkey rescue her] The battle is won. You may remove your helmet, good Sir Knight.\nShrek: Uh, no...\nPrincess Fiona: Why not?\nShrek: I... have helmet hair.\nPrincess Fiona: Please. I would'st look upon the face of my rescuer.\nShrek: Oh, no, you wouldn't... tst.\nPrincess Fiona: But... how will you kiss me?\nShrek: [bangs his head] What? That wasn't in the job description!\nThe Donkey: Maybe it's a perk!\nPrincess Fiona: No, it's destiny! You must know how it goes! A princess locked in a tower and beset by a dragon is rescued by a brave knight, and then they share true love's first kiss.\nThe Donkey: With Shrek? Whoa, whoa, whoa... you think, you think that Shrek is your true love?\nPrincess Fiona: Well, yes!\n[Shrek and Donkey look at each other and burst into laughter]\nPrincess Fiona: What is so funny?\nShrek: Let's just say, I'm not your type, all right?",
            "Villager #2: [Shrek sneaks up on a mob about to storm his swamp] Think it's in there?\nVillager #1: All right. Let's get it!\nOgre Hunter #3: Whoa. Hold on. Do you know what that thing can do to you?\nOgre Hunter #2: Yeah, it'll grind your bones for it's bread!\nShrek: [chuckles and the villagers saw him] Yes, well, actually, that would be a giant. Now ogres, oh, they're much worse! They'll make a suit from your freshly peeled skin.\nVillager #5: [scared] No!\nShrek: They'll shave your liver. Squeeze the jelly from your eyes! Actually, it's quite good on toast.\nOgre Hunter #1: [brandishes a torch at Shrek] BACK! Back, beast! Back! I warn ya!\n[Shrek licks his fingers and puts out the torch]\nOgre Hunter #1: Right.\n[Shrek roars at the villagers, rendering them petrified for some time]\nShrek: [whispers] This is the part where you run away.\n[the villagers flee]\nShrek: [laughs happily] And stay out!",
            "Donkey: I don't get it, Shrek. Why didn't you just pull some of that ogre stuff on him? You know, throttle him, lay siege to his fortress, grind his bones to make your bread? You know, the whole ogre trip.\nShrek: Oh, I know. Maybe I could have decapitated an entire village, put their heads on a pike, gotten a knife, cut open their spleens and drink their fluids. Does that sound good to you?\nDonkey: Uh... no, not really, no.",
            "Donkey: Say, Shrek, what're we gonna do with our swamp?\nShrek: OUR swamp?\nDonkey: You know, when we're though rescuing the princess and all that...\nShrek: Donkey, there's no \"we\", no \"our\". There's just ME and MY swamp! And the first thing I'm gonna do is build a ten-foot wall around my land.\nDonkey: You cut me deep, Shrek. You cut me very deep just now... You know what, Shrek? I think this whole wall thing is to keep somebody out!\nShrek: [sarcastic] No! You think?\nDonkey: Are you hiding something?\nShrek: Let it go, Donkey.\nDonkey: Oh, this is one of those onion things, isn't it?\nShrek: No, it's one of those drop-it-and-leave-it-alone things.\nDonkey: Why won't you talk about it?\nShrek: Why do you WANT to talk about it?\nDonkey: Then why are you blocking?\nShrek: I'm not blocking!\nDonkey: Oh, yes you are!\nShrek: Donkey, I'm warning you...\nDonkey: Just who are you trying to keep away? Just tell me that, Shrek? Who?\nShrek: EVERYONE! Okay?\n[pause]\nDonkey: Oh, now we're getting somewhere!\nShrek: Oh, for the love of Pete...",
            "[Dragon looms above Donkey]\nDonkey: Oh, what large teeth you have!\n[Dragon roars]\nDonkey: I mean, white sparkly teeth! I know you probably hear this all the time from your food, but you must bleach or something 'cause that's one dazzling smile you got there! And do I detect a hint of minty freshness? And you know something, you're...\n[the Dragon looks closer and Donkey sees she's female]\nDonkey: A girl dragon... Oh, sure, I mean of COURSE you're a girl dragon! You're just reeking of feminine beauty and... hey, what's the matter with you, you got somethin' in your eye?\n[Dragon blows out a heart-shaped cloud of smoke]\nDonkey: Ohh... well, you know, I gotta go. I'm an asthmatic, I don't hold with smoke rings and stuff. SHREK!\n[Dragon picks Donkey up and carries him away]",
            "Donkey: Hey, look at this!\n[he goes up to an information booth and pulls a lever. After some clicking, many mechanized marionettes pop out and begin singing]\nClockwork Chorus: Welcome to Duloc, such a perfect town / Here we have some rules, let us lay them down: / Don't make waves, stay in line / And we'll get along fine / Duloc is a perfect place!\nClockwork Chorus: Please keep off of the grass / Shine your shoes, wipe your... FACE! / Duloc is, Duloc is / Duloc is a perfect... place!\n[the booth takes Donkey and Shrek's photo, showing them stunned]\nDonkey: Wow. Let's do that again!\nShrek: [grabs Donkey] No! No, no no no. No.",
            "Donkey: Shrek, remember when you said that ogres have layers?\nShrek: Oh, aye?\nDonkey: Well, I have a bit of a confession to make: donkeys don't have layers. We wear our fear right there on our sleeves.\nShrek: Wait a second, donkeys don't have sleeves!\nDonkey: You know what I mean.\nShrek: Oh, you can't tell me you're afraid of heights?\nDonkey: No, I'm just uncomfortable about being on a rickety bridge over a boiling lake of lava!",
            "[Shrek burps in front of Donkey and Fiona]\nThe Donkey: Shrek!\nShrek: What? It's a compliment. Better out than in, I always say.\nThe Donkey: But that's no way to behave in front of a princess.\n[Fiona burps louder]\nPrincess Fiona: Thanks.\nThe Donkey: [to Shrek] She's as nasty as you are.",
            "Pinocchio: I'm not a puppet, I'm a real boy!\n[nose grows]\nCaptain of Guards: Five shillings for the possessed toy. Take it away.",
            "Donkey: ...And then one time I ate some rotten berries. Man, there were some strong gases seepin' outta my butt that day!",
            "The Donkey: All right, I hope you heard that? She called me a \"noble steed.\" She thinks I'm a steed.",
            "[Shrek bursts into Fiona's and Farquaad's wedding]\nLord Farquaad: Now really, it's rude enough being alive when no one wants you, but showing up uninvited to a wedding?",
            "Donkey: All right, nobody move! I've got a dragon and I'm not afraid to use it! I'm a donkey on the edge!",
            "Shrek: Does anyone know where this Farquaad guy is?\n[Donkey jumps up and down, shouting out]\nDonkey: Oh, I know! I know where he is!\nShrek: Does anyone ELSE know where to find him?\nDonkey: Pick me! Pick me! Me! Me!",
            "Shrek: [to Donkey] I already told you, didn't I? You're not coming home with me! I live alone! MY swamp! ME! Nobody else, understand? NOBODY! Especially useless, pathetic, annoying, TALKING *DONKEYS*!\nDonkey: But... I thought...\nShrek: Yeah, well, you know what? You thought wrong.",
            "[eyeing the \"KEEP OUT\" signs surrounding Shrek's home]\nDonkey: I guess you don't, uh... entertain much, do you?\nShrek: I like my privacy.\nDonkey: Y'know, I do too. That's another thing we have in common. I hate it when you've got someone in your face, you try to give someone a hint and they won't leave, and then there's that big awkward silence, y'know?\n[big awkward silence ensues]\nDonkey: Can I stay with you?\nShrek: What?\nDonkey: Can I stay with you... *please?*\nShrek: Of course!\nDonkey: Really?\nShrek: No.\nDonkey: Please! I don't wanna go back there, you don't know what it's like to be treated as a freak!... Well, maybe you do... but that's why we gotta stick together! You gotta let me stay! Please! PLEASE!",
            "[Shrek discovers the seven dwarves have placed Snow White on his kitchen table]\nShrek: Oh, no no no no! Dead broad OFF the table!\nDwarf: Well, where are we supposed to put her? The bed's taken!\nShrek: Huh?\n[rushes over to his bed to find...]\nBig Bad Wolf: What?",
            "Donkey: Okay, let me get this straight: you gonna go fight a dragon and rescue a princess just so Farquaad'll give you back your swamp, which you only don't have 'cause he filled it full of freaks in the first place. Is that about right?\nShrek: You know what? Maybe there's a good reason donkeys shouldn't talk.",
            "Shrek: Go over there and see if you can find any stairs.\nDonkey: Stairs? I thought we was lookin' for the Princess.\nShrek: The Princess will be up the stairs in the highest room in the tallest tower.\nDonkey: How do you know that?\nShrek: I read it in a book once.\nDonkey: Cool! You handle the dragon, I'll handle the stairs!",
            "Shrek: Um... Princess?\nPrincess Fiona: Yes... Shrek?\nShrek: I... um... I was wondering... are you... um... are you going to eat that?",
            "[Fiona notices it's sunset]\nPrincess Fiona: [uneasy] Shouldn't we stop to make camp?\nShrek: No, that'll take longer. We can keep going.\nPrincess Fiona: But, there's... ROBBERS, in the woods!\nDonkey: Whoa! Time out, Shrek! Camp is definitely starting to sound good!\nShrek: Hey, come on, I'm scarier than anything we're gonna meet in this forest...\nPrincess Fiona: [in Shrek's face] I need to find somewhere to camp NOW!",
            "Shrek: Thank you, thank you very much. I'm here 'til Thursday. Try the veal.",
            "[Shrek and Donkey are crossing a wooden bridge over a moat of lava]\nDonkey: Don't look down, don't look down, don't look down, keep on moving, don't look down...\n[a board under Donkey breaks, prompting Donkey...]\nDonkey: Shrek, I'm looking down!",
            "[Donkey and Shrek are looking at constellations in the night sky]\nThe Donkey: So, uh, are there any donkeys up there?\nShrek: Well, there's, um, Gabby, the Small and Annoying.\nThe Donkey: Okay, okay, I see it now. The big shiny one, right there. That one there?\nShrek: That's the moon.\nThe Donkey: Oh, okay.",
            "Shrek: Fiona? Are you all right?\n[Fiona looks at herself, and sees she is still an ogre]\nPrincess Fiona: Yes. But, I don't understand. I'm supposed to be beautiful.\nShrek: But you are beautiful.\nDonkey: I was hoping this would be a happy ending...\n[Shrek and Fiona kiss]",
            "Donkey: Okay, so here's another question: Say there's a woman who digs you, right, but you really don't like her THAT quick - now how do you let her down real easy so her feelings aren't hurt, but you don't get burned to a crisp and eaten? How do you do that?\nPrincess Fiona: Just tell her she's not your true love!",
            "Donkey: Oh, now I really see what's going on...\nShrek: I don't know what you're talking about...\nDonkey: Hey, I don't even wanna hear... Look, I'm an animal, I got instincts, and I know you two were diggin' on each other!\nShrek: Oh, you're crazy! I'm just bringing her back to Farquaad!\nDonkey: Oh, come on, Shrek, wake up and smell the pheromones! Just go in there and tell her you how you feel!\nShrek: Arrgh! There's nothing to tell! Even if I DID have... I'm not saying I am, 'cause I don't... she's a princess! And I'm...\nDonkey: An ogre?\nShrek: Yeah. An ogre.\n[walks away]\nDonkey: Where're you going?\nShrek: To get... more firewood.\n[Donkey looks askance at a full pile of firewood]",
            "Donkey: Wow, that was really scary. And if you don't mind me saying, if that don't work your breath will certainly get the job done, cause you definitely need some Tic Tacs or something cause your breath STINKS!",
            "Donkey: I just know, before this is over, I'm gonna need a whole lot of serious therapy. Look at my eye twitchin'.",
            "[Princess Fiona has just defeated Monsieur Hood and his Merry Men single-handed]\nPrincess Fiona: Well, when one lives alone, one has to learns these things in case there's...\n[points]\nPrincess Fiona: There's an arrow in your butt!\nShrek: What?\n[looks at arrow]\nShrek: Oh, would you look at that?",
            "Princess Fiona: I wanted to show you before...\n[turns into an ogre]\nShrek: Well... er... THAT explains a lot.\nLord Farquaad: [revolted] It's disgusting!",
            "Shrek: So... what did Fiona say about me?\nDonkey: Ah, what're you asking me for? Why don't you go and ask her!\nShrek: The wedding! We'll never make it in time!\nDonkey: Ha-ha-ha! Never fear! Where there's a will, there's a way. And I have a way.\n[blows a whistle, and Dragon appears in the sky; an overjoyed Shrek grabs Donkey and cuddles him]\nDonkey: All right, all right, that's enough. No one likes a kiss-ass.",
            "Captain of Guards: What have you got?\nOld Woman: Well, I have a talking donkey.\nCaptain of Guards: Really? Well, that's good for ten shillings... if you can prove it.\nOld Woman: Go ahead, little fella.\n[Donkey says nothing]\nCaptain of Guards: Well?\nOld Woman: He's just a little nervous. He's really quite the chatterbox. Talk, you boneheaded dolt...\nCaptain of Guards: That's it, I've heard enough. Guards?\nOld Woman: No, no! He talks. He does...\n[moves Donkey's mouth while trying to throw her voice]\nOld Woman: I can talk. I love to talk. I'm the talkingest damn thing you ever saw.\nCaptain of Guards: Get her out of my sight!",
            "Baby Bear: This cage is too small.",
            "Princess Fiona: You're an ogre...\nShrek: Oh, you were expecting Prince Charming?\nPrincess Fiona: Well, yes, actually. Oh... this is wrong. This is all wrong! It's not supposed to be an ogre!",
            "Shrek: Donkey? What are you doing?\nDonkey: [gathering branches] I would think YOU of all people would recognize a wall when you saw one!\nShrek: Well, yeah... but the wall's supposed to go AROUND my swamp, not through it!\nDonkey: It is around your swamp! That's your half and this's mine!\nShrek: Oh, your half! Hmmm!\nDonkey: Yes, MY half! I helped rescue the Princess! I did half the work, I get half the booty! Now hand over that big rock, the one that looks like your head!",
            "[Shrek rescues Fiona]\nPrincess Fiona: What are you doing? You know, you should sweep me off my feet out yonder window and down a rope onto your valiant steed.\nShrek: You've had a lot of time to plan this, haven't you?\nPrincess Fiona: [nods] Mmmh-hmm",
            "The Donkey: Wait a minute, I know what's going on. You're afraid of the dark.\nPrincess Fiona: Why... yes!\nThe Donkey: Don't worry, princess. I used to be afraid of the dark until... No, wait. I'm still afraid of the dark.",
            "The Donkey: [waking up] Uh... What'd I miss? What'd I miss?\n[suddenly notices the guards walking by]\nThe Donkey: [trying to throw his voice] Who said that? Couldn't have been the donkey.",
            "Shrek: I live in a swamp! I put up signs! I'm a terrifying ogre! What do I have to do to get a little privacy?",
            "Lord Farquaad: I will have order! I will have perfection! I will have...\n[gets eaten by Dragon]",
            "[Thelonius dunks the Gingerbread Man in a glass of milk]\nLord Farquaad: That's enough! He's ready to talk.",
            "Shrek: Okay, you two, head for the exit!\n[Fiona and Donkey run, Shrek grabs a sword]\nShrek: I'll take care of the Dragon...",
            "Wrestling Fan: [watching Shrek fight in a wrestling ring] The chair! Give him the chair!",
            "Gingerbread Man: God bless us, everyone!",
            "Captain of Guards: [to Shrek, after finding him and Donkey in the woods] You there! Ogre!\nShrek: Aye?\nCaptain of Guards: [to both Shrek and Donkey] By the order of Lord Farquaad, I am authorized to place you both under arrest and transport you to a designated resettlement facility.\nShrek: Oh, really? You and what army?\n[the Captain looks behind him and notices that his soldiers have run away, leaving their spears behind. He does the same]",
            "Shrek: Um... Fiona?\nPrincess Fiona: Yes, Shrek?\nShrek: I... I love you.\nPrincess Fiona: Really?\nShrek: Really, really!\nPrincess Fiona: Mmmm... I love you too.\n[they kiss. Thalonius writes \"Awwww\" on a cue card for the audience. Fiona floats up in the air and her enchantment breaks in a blaze of light...]",
            "[Monsieur Hood abducts Fiona]\nShrek: Hey, that's my princess! Go find your own!",
            "[staring up at the starry night]\nShrek: [pointing at a constellation] ... and that one, that's Throwback, the only ogre to spit over three wheat fields.\nDonkey: Okay, I see it. Hey, Shrek, can you tell my future from these stars?\nShrek: Well, the stars don't tell the future, Donkey, they tell stories. That one is Bloodnok, the Flatulent. You can guess what HE's famous for...\nDonkey: Okay, now I know you're making that up!\nShrek: [pointing] No! See, that's him, and this is the group of hunters running away from his stench.\nDonkey: Man, that ain't nothing but a bunch of little dots.\nShrek: You know, Donkey, things are more than what they seem, hmm?... Forget it.\n\n",
            "Lord Farquaad: Princess Fiona... she's perfect!",
            "[a squad of archers aim at Shrek]\nCaptain of Guards: Shall I give the order, my Lord?\nLord Farquaad: No. I have a better idea...",
            "Captain of Guards: [snaps a witch's broomstick in half] Your flying days are over!",
            "Princess Fiona: [Shrek interrupts her and Farquaad's wedding] What are you doing here?\nLord Farquaad: Really, it's rude enough being alive when no one wants you, but showing up uninvited to a wedding...\nShrek: Fiona! I need to talk to you.\nPrincess Fiona: Oh, now you wanna talk? Well, it's a little late for that, so if you'll excuse me...\nShrek: But you can't marry him.\nPrincess Fiona: And why not?\nShrek: Because... because he's just marrying you so he can be king.\nLord Farquaad: Outrageous! Fiona, don't listen to him.\nShrek: He's not your true love.\nPrincess Fiona: And what do you know about true love?\nShrek: Well, I... uh... I mean...\nLord Farquaad: Oh, this is precious.\n[chuckling]\nLord Farquaad: The ogre has fallen in love with the princess! Oh, good Lord.\n[signaling his guards, one of them holds up a cue card reading \"Laugh\", and the attendees roar with laughter]\nLord Farquaad: An ogre and a princess!\nPrincess Fiona: Shrek, is this true?\nLord Farquaad: Who cares? It's preposterous! Fiona, my love, we're but a kiss away from our happily ever after. Now kiss me!",
            "[Blind Mouse is on Shrek's shoulder, sniffing]\nBlind Mouse: I found some cheese.\n[Blind Mouse bites Shrek in the ear]\nShrek: Ow!\nBlind Mouse: Ugh! Awful stuff.",
            "Lord Farquaad: [Shrek has barged into the tournament] Knights, new plan! The one who kills the ogre, will be named champion! Have at him!\n[all the knights draw their weapons and converge on Shrek]\nShrek: Okay, now... can't we just settle this over a pint!\n[holds up a friendly mug, to no avail]\nShrek: No? All right then! COME ON!\n[He bursts one of the ale barrels]",
            "Lord Farquaad: [Fiona reveals herself to be an ogre, too] This hocus-pocus alters nothing. This marriage is binding, and that makes me king!",
            "Princess Fiona: [an arrow is stuck in Shrek's butt] Now you hold still, and I'll yank this thing out.\nShrek: [jumping in pain] Ow! Hey! Easy with the yankin'.\nPrincess Fiona: Well, I'm sorry, but it... but it has to come out.\nShrek: No, no, it's tender.\n[she continues to try and remove it while he tries to stop her]\nPrincess Fiona: Now, hold on.\nShrek: Would... would you... what you're doing is the opposite of help.",
            "Shrek: I'm sorry. I guess I am just a big, stupid, ugly ogre. Can you forgive me?\nDonkey: Hey, that's what friends are for, right?\nShrek: Right. Friends?\nDonkey: Friends.",
            "[At the slop, Fiona slides down and she is happy about being rescued]\nPrincess Fiona: You did it! You rescued me! You're amazing. You're... You're wonderful. You're...\n[turns and sees Shrek fall down the slop and bump into Donkey]\nPrincess Fiona: A little unorthodox, I'll admit. But thy deed is great, and thine heart is pure. I am eternally in your debt.\n[Donkey clears his throat]\nPrincess Fiona: And where would a brave knight be without his noble steed?\nDonkey: All right, I hope you heard that. She called me a noble steed. She think I'm a steed.",
            "Lord Farquaad: [Slowly and dramatically to the looking glass] Magic... mirror... on... the wa...\nGingerbread Man: DON'T TELL HIM ANYTHING!",
            "Shrek: What are you doing in my swamp?",
            "Donkey: What's the point of being able to talk if you gotta keep secrets?",
            "Donkey: Please don't turn me in. I'll never be stubborn again. I can change. PLEASE! Give me another chance!\nOld Woman: Oh, shut up.\n[she slaps him]\nDonkey: Oh!\nCaptain of Guards: Next!",
            "Monsieur Hood: [swings in to grab Fiona] La liberte! Hey!\nShrek: Princess!\nPrincess Fiona: What are you doing?\nMonsieur Hood: Be still, mon cherie, for I am your savior! And I am rescuing you from this green - -\n[kissing sounds]\nMonsieur Hood: - -beast.\nShrek: Hey! That's my princess! Go find your own!\nMonsieur Hood: Please, monster! Can't you see I'm a little busy here?\nPrincess Fiona: Look, pal, I don't know who you think you are!\nMonsieur Hood: Oh! Of course! Oh, how rude. Please let me introduce myself. Oh, Merry Men.\n[laughs]",
            "Donkey: Alright. Alright. Don't get so sloppy. No one likes a kiss ass.",
            "Donkey: Celebrity marriages. They never last, do they?"
        ]
    },
    "shrek_2": {
        "name": "Shrek 2",
        "year": 2001,
        "quotes": [],
        "top_cast": []
    },
    "shrek_the_third": {
        "name": "Shrek the Third",
        "year": 2001,
        "quotes": [],
        "top_cast": []
    },
    "shrek_forever_after": {
        "name": "Shrek Forever After",
        "year": 2001,
        "quotes": [],
        "top_cast": []
    },
    "shrek_5": {
        "name": "Shrek 5",
        "year": 2001,
        "quotes": [],
        "top_cast": []
    }
}