{
    "shrek": {
        "id": 0,
        "name": "Shrek",
        "year": 2001,
        "top_cast": [
            {
                "name": "Mike Myers",
                "characters": [
                    "Shrek",
                    "Blind Mouse",
                    "Opening Narration"
                ]
            },
            {
                "name": "Eddie Murphy",
                "characters": [
                    "Donkey"
                ]
            },
            {
                "name": "Cameron Diaz",
                "characters": [
                    "Princess Fiona"
                ]
            },
            {
                "name": "John Lithgow",
                "characters": [
                    "Lord Farquaad"
                ]
            },
            {
                "name": "Vincent Cassel",
                "characters": [
                    "Monsieur Hood"
                ]
            },
            {
                "name": "Peter Dennis",
                "characters": [
                    "Ogre Hunter"
                ]
            },
            {
                "name": "Clive Pearse",
                "characters": [
                    "Ogre Hunter"
                ]
            },
            {
                "name": "Jim Cummings",
                "characters": [
                    "Captain of Guards"
                ]
            },
            {
                "name": "Bobby Block",
                "characters": [
                    "Baby Bear"
                ]
            },
            {
                "name": "Chris Miller",
                "characters": [
                    "Geppetto",
                    "Magic Mirror"
                ]
            },
            {
                "name": "Cody Cameron",
                "characters": [
                    "Pinnochio",
                    "Three Pigs"
                ]
            },
            {
                "name": "Kathleen Freeman",
                "characters": [
                    "Old Woman"
                ]
            },
            {
                "name": "Michael Galasso",
                "characters": [
                    "Peter Pan"
                ]
            },
            {
                "name": "Christopher Knights",
                "characters": [
                    "Blind Mouse",
                    "Thelonious"
                ]
            },
            {
                "name": "Simon J. Smith",
                "characters": [
                    "Blind Mouse"
                ]
            },
            {
                "name": "Conrad Vernon",
                "characters": [
                    "Gingerbread Man"
                ]
            },
            {
                "name": "Jacquie Barnbrook",
                "characters": [
                    "Wrestling Fan"
                ]
            },
            {
                "name": "Guillaume Aretos",
                "characters": [
                    "Merry Man"
                ]
            },
            {
                "name": "John Bisom",
                "characters": [
                    "Merry Man"
                ]
            },
            {
                "name": "Matthew Gonder",
                "characters": [
                    "Merry Man"
                ]
            },
            {
                "name": "Calvin Remsberg",
                "characters": [
                    "Merry Man"
                ]
            },
            {
                "name": "Jean-Paul Vignon",
                "characters": [
                    "Merry Man"
                ]
            },
            {
                "name": "Val Bettin",
                "characters": [
                    "Bishop"
                ]
            }
        ],
        "quotes": [
            "[Shrek enters the tournament]\nLord Farquaad: What's that? It's hideous!\nShrek: Well, that's not very nice.\n[gestures to Donkey]\nShrek: It's just a donkey.",
            "Donkey: We can stay up late, swapping manly stories, and in the morning, I'm making waffles!",
            "Princess Fiona: Where are you going? The exit's over there!\nShrek: [going to save Donkey] Well, I have to save my ass.\nPrincess Fiona: [shocked] What kind of knight ARE you?\nShrek: One of a kind.",
            "[looking for a certain type of flower]\nDonkey: Blue flower, red thorns. Blue flower, red thorns. Blue flower, red thorns. Man, this would be so much easier if I wasn't COLOR-BLIND!",
            "Donkey: [looks at a hovel] Whoa, look at that. Who'd wanna live in a place like that?\nShrek: 'That' would be my home.\nDonkey: Oh... and it is LOVELY! You know, you're really quite a decorator. It's amazing what you've done with such a modest budget. I like that boulder. That is a NICE boulder.",
            "Shrek: For your information, there's a lot more to ogres than people think.\nDonkey: Example?\nShrek: Example... uh... ogres are like onions!\n[holds up an onion, which Donkey sniffs]\nDonkey: They stink?\nShrek: Yes... No!\nDonkey: Oh, they make you cry?\nShrek: No!\nDonkey: Oh, you leave 'em out in the sun, they get all brown, start sproutin' little white hairs...\nShrek: [peels an onion] NO! Layers. Onions have layers. Ogres have layers... You get it? We both have layers.\n[walks off]\nDonkey: Oh, you both have LAYERS. Oh. You know, not everybody like onions. CAKE! Everybody loves cake! Cakes have layers!\nShrek: I don't care what everyone likes! Ogres are not like cakes.\nDonkey: You know what ELSE everybody likes? Parfaits! Have you ever met a person, you say, \"Let's get some parfait,\" they say, \"Hell no, I don't like no parfait.\"? Parfaits are delicious!\nShrek: NO! You dense, irritating, miniature beast of burden! Ogres are like onions! End of story! Bye-bye! See ya later.\nDonkey: Parfait's may be the most delicious thing on the whole damn planet!",
            "Donkey: Hi, Princess!\nPrincess Fiona: It talks!\nShrek: Yeah, it's getting him to shut up that's the trick!",
            "Donkey: Hey, what's your problem, Shrek, what you got against the whole world anyway, huh?\nShrek: Look, I'm not the one with the problem, okay? It's the world that seems to have a problem with ME! People take one look at me and go \"Aargh! Help! Run! A big stupid ugly ogre!\" They judge me before they even know me - that's why I'm better off alone...\nDonkey: You know, Shrek... when we first met, I didn't think you were a big, stupid, ugly ogre.\nShrek: Yeah, I know.",
            "[Shrek, his swamp filled with fairytale creatures, glares at Donkey]\nDonkey: Hey, don't look at me, I didn't invite them!\nPinocchio: Oh, gosh, no one invited us!\nShrek: What?\nPinocchio: We were forced to come here!\nShrek: By who?\nLittle Pig: Lord Farquaad. He huffed, and he puffed... and he signed an eviction notice.",
            "Shrek: Donkey, two things okay? Shut... up!",
            "Donkey: So where is this fire-breathin' pain in the neck, anyway?\nShrek: Inside, waiting for us to rescue her.\nDonkey: I was talkin' about the dragon, Shrek.",
            "[arriving at Duloc]\nShrek: [observing a giant building] That must be Lord Farquaad's castle... Do you think he's maybe compensating for something?",
            "[Donkey thinks he's dying]\nThe Donkey: Hey, where're you going? Oh man, I can't feel my toes!\n[Looks down and yelps]\nThe Donkey: I don't have any toes!\n[sits down]\nThe Donkey: I think I need a hug.",
            "Lord Farquaad: [playing with Gingy's legs] Run, run, run as fast as you can / You can't catch me, I'm the Gingerbread Man!\nGingerbread Man: You're a monster!\nLord Farquaad: [tossing legs away] I'm not the monster here, YOU are! You and the rest of that fairytale trash, poisoning my perfect world. Now tell me, where are the others?\nGingerbread Man: Eat me!\n[spits in Farquaad's face]\nLord Farquaad: I've tried to be fair to you creatures, but now my patience has reached its end! Tell me, or I'll...\n[reaches down]\nGingerbread Man: NO! Not the buttons! Not my gumdrop buttons!\nLord Farquaad: All right, then! Who's hiding them?\nGingerbread Man: Okay, I'll tell you... Do you know... the Muffin Man?\nLord Farquaad: The Muffin Man?\nGingerbread Man: The Muffin Man.\nLord Farquaad: Yes, I know the Muffin Man. W-who lives on Drury Lane?\nGingerbread Man: Well, she's married to the Muffin Man...\nLord Farquaad: The Muffin Man?\nGingerbread Man: THE MUFFIN MAN!\nLord Farquaad: She's married to the Muffin Man...",
            "Shrek: Listen, little donkey, take a look at me! What am I?\nDonkey: Ah... really tall?\nShrek: No! I'm an OGRE! You know, \"grab your torch and pitchforks!\" Doesn't that bother you?\nDonkey: Nope.\nShrek: Really?\nDonkey: Really, really.\nShrek: [taken aback] Oh.\nDonkey: Man, I like you. What's your name?\nShrek: Er... Shrek.",
            "Princess Fiona: The sooner we get to Duloc, the better!\nDonkey: Oh, you gonna love it there, Princess, it's beautiful!\nPrincess Fiona: And my groom-to-be Lord Farquaad, what's he like?\nShrek: Well, let me put it this way, Princess: men of his stature are in SHORT supply.\n[chortles]\nDonkey: Yeah! Though there are those who think LITTLE of him!\n[laughs]",
            "Helpful\n•\n43\n\n1\n\nPrincess Fiona: [hears a roar] You didn't slay the dragon?\nShrek: It's on my to-do list, now come on!\nPrincess Fiona: But this isn't right! You're meant to charge in, sword drawn, banners flying! That's what all the other knights did!\nShrek: Yeah, right before they burst into flame!\n[They pass a skeleton of one of the unfortunate victims]\nPrincess Fiona: That's not the point...!",
            "[the dragon has eaten Lord Farquaad and spits out his crown]\nDonkey: Huh, celebrity marriages. They never last, do they?\n[receives applause from the crowd]\nDonkey: Good evening, people.",
            "Captain of Guards: [as Donkey flies through the air on pixie dust] He can talk!\nDonkey: That's right, fool! Now I'm a flying talking donkey! You might have seen a housefly, maybe even a superfly, but I bet you ain't never seen a donkeyfly! Ha, ha!\n[pixie dust wears off]\nDonkey: Uh-oh!",
            "Shrek: That'll do, Donkey. That'll do.",
            "[Donkey keeps humming the \"Duloc\" song]\nShrek: All right, you're going the right way for a smacked bottom.\nDonkey: Sorry 'bout that.",
            "Lord Farquaad: [to his knights] The winner of this tournament - no, no, the privilege - will have the honour of rescuing the beautiful Princess Fiona from the fiery pit of that dragon! Should the winner fail to return, the runner-up shall take his place, and so on and so forth... Some of you may die, but it's a sacrifice I am willing to make.",
            "Donkey: You're so wrapped up in layers onion boy, you're afraid of your own feelings!\nShrek: [hiding in the toilet] Go away!\nDonkey: See? There you are, doing it again! Just like you did to Fiona! All she ever did was like you maybe, even love you!\nShrek: LOVE me? She said I was ugly, a hideous creature! I heard the two of you talking!\nDonkey: She wasn't talking about you, okay? She was talking about... uh... somebody else.\nShrek: [comes out] She... wasn't... talking about me?",
            "[Shrek has been hit by an arrow]\nPrincess Fiona: Oh!... oh, this is all my fault...\nDonkey: Why, what's wrong?\nPrincess Fiona: Shrek's hurt!\nDonkey: Shrek's hurt? Shrek's HURT? Oh, no, Shrek's gonna die!\nShrek: Donkey, I'm okay!\nDonkey: You can't do this to me, Shrek, I'm too young for you to die! Keep your feet elevated! Turn your head and cough! Does anybody know the Heimlich...?\nPrincess Fiona: [grabs Donkey] Donkey, calm down! If you want to help Shrek, go into the forest and look for a blue flower with red thorns.\nDonkey: Blue flower, red thorns! Okay, I got it! Blue flower, red thorns! Blue flower, red thorns! Don't die, Shrek, and if you see any long tunnels, stay away from the light!\nShrek: DONKEY!\nDonkey: Okay, okay. Blue flower, red thorns! Blue flower, red thorns!\n[runs off]\nShrek: What're the flowers for?\nPrincess Fiona: For getting rid of Donkey.",
            "[as they approach Fiona's castle, Donkey smells the air]\nDonkey: Woah, Shrek, did you do that? Man, you gotta warn somebody before you just crack one off, my mouth was open and everything!\nShrek: Believe me, Donkey, if it was me, you'd be dead!\n[sniffs]\nShrek: It's brimstone. We must be getting close.\nDonkey: Yeah, right, brimstone. Don't be talking about \"it's the brimstone\". I know what I smelled and it wasn't no brimstone and it didn't come off no stone neither.",
            "Princess Fiona: [as ogre] Donkey, shh, shh. It's me... in this body.\nDonkey: [gasps] Oh, my God, you ate the princess!",
            "Merry Men: [singing] Ta da, da da da da - whoo!\nMonsieur Hood: I steal from the rich and give to the needy...\nMerry Man: He takes a wee percentage...\nMonsieur Hood: But I'm not greedy - I rescue pretty damsels, man I'm good!\nMerry Men: What a guy, ha ha, Monsieur Hood!\nMonsieur Hood: Break it down...\n[Merry Men Irish step dance]\nMonsieur Hood: I like an honest fight and a saucy little maid...\nMerry Men: What he's basically saying is he likes to get...\nMonsieur Hood: Paid!\nMonsieur Hood: So, when an ogre in the bush grabs a lady by the tush, that's bad.\nMerry Man: [joining in] That's bad, that's bad, that's bad!\nMonsieur Hood: When a beauty's with a beast it makes me awfully mad!\nMerry Men: He's mad, he's really, really mad!\nMonsieur Hood: Now I'll take my blade and ram it through your heart Keep your eyes on me, boys, 'Cause I'm about to start...\n[Fiona swoops in and kicks him - the music stops]\nPrincess Fiona: Man, that was annoying!",
            "Magic Mirror: [telling Lord Farquaad about his bachelorettes] So, just sit back and relax, my Lord, because I'm about to give you today's three eligible bachelorettes.\n[the mirror shows images of Cinderella]\nMagic Mirror: Our first bachelorette is a mentally abused shut-in from a kingdom far, far away. She likes sushi and hot-tubbing any time. Her hobbies include cooking and cleaning for her two evil sisters. Let's hear it for Cinderella!\n[changes to images of Snow White]\nMagic Mirror: Bachelorette number two is a cape-wearing girl from the Land of Fantasy. Although she lives with seven other men, she's not easy. Just kiss her frozen, dead lips and find out what a live wire she is. Give it up for Snow White!\n[changes to Princess Fiona]\nMagic Mirror: And last but not least is a fiery redhead who lives in a dragon-guarded castle surrounded by a boiling lake of lava! But don't let that cool you off. She's a loaded pistol who likes piña coladas and getting caught in the rain. Yours for the rescuing: Princess Fiona! So, who will it be? Bachelorette #1? Bechelorette #2? Or Bachelorette #3?\n[Farquaad's advisors start calling out their choices, with Thelonious saying \"#3\"]\nLord Farquaad: Uhhh, Number 3!\nMagic Mirror: Lord Farquaad, you have chosen... Princess Fiona.",
            "Donkey: I'll find those stairs. I'll whip their butt, too. Those stairs won't know which way they're going... take drastic steps, kick it to the curb. Don't mess wit' me. I'm the Stair Master. I've mastered the stairs. I wish I had a step right here, right now, I'd step all over it...",
            "Shrek: Princess, I was SENT to rescue you by Lord Farquad, okay? HE's the one that wants to marry you.\nPrincess Fiona: Well, why didn't he come to rescue me?\nShrek: Good question! You can ask him that when we get there...\nPrincess Fiona: But I'm supposed to be rescued by my true love, not by some ogre a-a-and his PET!\nDonkey: Well, so much for noble steed!\nShrek: Look, Princess, you're not making my job any easier...\nPrincess Fiona: Well, I'm sorry, but your job is not my problem. You tell Lord \"Far-Quad\" that if he wants to rescue me PROPERLY, I'll be waiting for him right here!\n[sits down]\nShrek: Hey! I'm nobody's messenger boy, all right? I'm a delivery boy!\nPrincess Fiona: You wouldn't dare...!\n[Shrek carries her off]\nShrek: You coming, Donkey?\nDonkey: Yeah, I'm right behind you.",
            "Donkey: Shrek! Hold up, Shrek! You got to wait for the line!\nShrek: [about to burst into the cathedral] What are you talking about?\nDonkey: The line, the line you gotta wait for: the priest's gonna say \"Speak now or forever hold your piece\", and you rush in and say \"I object!\"\nShrek: I don't have time for all that!\n[runs forward]\nDonkey: [stops Shrek] You love this woman, don't ya?\nShrek: Yes.\nDonkey: Do you wanna hold her?\nShrek: Yes!\nDonkey: Please her?\nShrek: YES!\nDonkey: Then ya gotta, gotta try a little TENDERNESS! Chicks love that romantic crap!\nShrek: All right, cut it out! When does this guy say the line?\nDonkey: ...We gotta check that out.",
            "[Dragon, having a crush on Donkey, is cuddling him]\nDonkey: [desperately talking] I don't want to rush into a... physical relationship... I'm not that emotionally ready for a... uh... commitment of this... uh... magnitude! Really, that's the word I'm looking for, magnitude... Huh! Hey, that is unwanted physical contact! Hey! What're you doing? Okay, okay, okay... let's just back up a little and take this one step at a time... I mean, we should really get to know each other first, you know, as friends or maybe even as pen pals, you know, coz I'm on the road a lot, but I just love to get a card... Hey, hey, hey, don't do that, that's my TAIL, that's my personal tail, you gonna tear it off! I don't give permission to... Hey, what're you gonna do with that? Oh, no, no, no, no... no!",
            "[first lines]\n[a fairytale book appears]\nShrek: [narrating] Once upon a time, there was a lovely princess. But she had an enchantment upon her of a fearful sort, which could only be broken by love's first kiss. She was locked away in a castle guarded by a terrible fire-breathing dragon. Many brave knights had attempted to free her from this dreadful prison, but none prevailed. She waited in the dragon's keep, in the highest room of the tallest tower, for her true love, and true love's first kiss.\n[tears out a page from the book and shuts it]\nShrek: [laughs] Like THAT's ever gonna happen! What a load of...\n[flushes toilet and comes out of the outhouse]",
            "Shrek: [to Donkey] WHY are you following me?\nDonkey: Oh, I'll tell you why.\n[starts to sing]\nDonkey: 'Cause I'm all alone / There's no one here beside me / My problems have all gone / There's no one to deride me! / But ya gotta have friends...\nShrek: STOP SINGING! Well, it's no wonder you don't have any friends!\nDonkey: Wow! Only a TRUE friend would be that cruelly honest!",
            "Lord Farquaad: Mirror, mirror, on the wall - is this not the most perfect kingdom of them all?\nMagic Mirror: Well, technically, you're not a king.\nLord Farquaad: Ah, Thelonius?\n[Thelonius the Executioner holds up a small mirror and smashes it]\nLord Farquaad: You were saying?\nMagic Mirror: [nervous] What I mean is, er, you're not a king YET! Heh, but-but you can become one! All you have to do is marry a princess.\nLord Farquaad: Go on...",
            "Princess Fiona: [after Shrek and Donkey rescue her] The battle is won. You may remove your helmet, good Sir Knight.\nShrek: Uh, no...\nPrincess Fiona: Why not?\nShrek: I... have helmet hair.\nPrincess Fiona: Please. I would'st look upon the face of my rescuer.\nShrek: Oh, no, you wouldn't... tst.\nPrincess Fiona: But... how will you kiss me?\nShrek: [bangs his head] What? That wasn't in the job description!\nThe Donkey: Maybe it's a perk!\nPrincess Fiona: No, it's destiny! You must know how it goes! A princess locked in a tower and beset by a dragon is rescued by a brave knight, and then they share true love's first kiss.\nThe Donkey: With Shrek? Whoa, whoa, whoa... you think, you think that Shrek is your true love?\nPrincess Fiona: Well, yes!\n[Shrek and Donkey look at each other and burst into laughter]\nPrincess Fiona: What is so funny?\nShrek: Let's just say, I'm not your type, all right?",
            "Villager #2: [Shrek sneaks up on a mob about to storm his swamp] Think it's in there?\nVillager #1: All right. Let's get it!\nOgre Hunter #3: Whoa. Hold on. Do you know what that thing can do to you?\nOgre Hunter #2: Yeah, it'll grind your bones for it's bread!\nShrek: [chuckles and the villagers saw him] Yes, well, actually, that would be a giant. Now ogres, oh, they're much worse! They'll make a suit from your freshly peeled skin.\nVillager #5: [scared] No!\nShrek: They'll shave your liver. Squeeze the jelly from your eyes! Actually, it's quite good on toast.\nOgre Hunter #1: [brandishes a torch at Shrek] BACK! Back, beast! Back! I warn ya!\n[Shrek licks his fingers and puts out the torch]\nOgre Hunter #1: Right.\n[Shrek roars at the villagers, rendering them petrified for some time]\nShrek: [whispers] This is the part where you run away.\n[the villagers flee]\nShrek: [laughs happily] And stay out!",
            "Donkey: I don't get it, Shrek. Why didn't you just pull some of that ogre stuff on him? You know, throttle him, lay siege to his fortress, grind his bones to make your bread? You know, the whole ogre trip.\nShrek: Oh, I know. Maybe I could have decapitated an entire village, put their heads on a pike, gotten a knife, cut open their spleens and drink their fluids. Does that sound good to you?\nDonkey: Uh... no, not really, no.",
            "Donkey: Say, Shrek, what're we gonna do with our swamp?\nShrek: OUR swamp?\nDonkey: You know, when we're though rescuing the princess and all that...\nShrek: Donkey, there's no \"we\", no \"our\". There's just ME and MY swamp! And the first thing I'm gonna do is build a ten-foot wall around my land.\nDonkey: You cut me deep, Shrek. You cut me very deep just now... You know what, Shrek? I think this whole wall thing is to keep somebody out!\nShrek: [sarcastic] No! You think?\nDonkey: Are you hiding something?\nShrek: Let it go, Donkey.\nDonkey: Oh, this is one of those onion things, isn't it?\nShrek: No, it's one of those drop-it-and-leave-it-alone things.\nDonkey: Why won't you talk about it?\nShrek: Why do you WANT to talk about it?\nDonkey: Then why are you blocking?\nShrek: I'm not blocking!\nDonkey: Oh, yes you are!\nShrek: Donkey, I'm warning you...\nDonkey: Just who are you trying to keep away? Just tell me that, Shrek? Who?\nShrek: EVERYONE! Okay?\n[pause]\nDonkey: Oh, now we're getting somewhere!\nShrek: Oh, for the love of Pete...",
            "[Dragon looms above Donkey]\nDonkey: Oh, what large teeth you have!\n[Dragon roars]\nDonkey: I mean, white sparkly teeth! I know you probably hear this all the time from your food, but you must bleach or something 'cause that's one dazzling smile you got there! And do I detect a hint of minty freshness? And you know something, you're...\n[the Dragon looks closer and Donkey sees she's female]\nDonkey: A girl dragon... Oh, sure, I mean of COURSE you're a girl dragon! You're just reeking of feminine beauty and... hey, what's the matter with you, you got somethin' in your eye?\n[Dragon blows out a heart-shaped cloud of smoke]\nDonkey: Ohh... well, you know, I gotta go. I'm an asthmatic, I don't hold with smoke rings and stuff. SHREK!\n[Dragon picks Donkey up and carries him away]",
            "Donkey: Hey, look at this!\n[he goes up to an information booth and pulls a lever. After some clicking, many mechanized marionettes pop out and begin singing]\nClockwork Chorus: Welcome to Duloc, such a perfect town / Here we have some rules, let us lay them down: / Don't make waves, stay in line / And we'll get along fine / Duloc is a perfect place!\nClockwork Chorus: Please keep off of the grass / Shine your shoes, wipe your... FACE! / Duloc is, Duloc is / Duloc is a perfect... place!\n[the booth takes Donkey and Shrek's photo, showing them stunned]\nDonkey: Wow. Let's do that again!\nShrek: [grabs Donkey] No! No, no no no. No.",
            "Donkey: Shrek, remember when you said that ogres have layers?\nShrek: Oh, aye?\nDonkey: Well, I have a bit of a confession to make: donkeys don't have layers. We wear our fear right there on our sleeves.\nShrek: Wait a second, donkeys don't have sleeves!\nDonkey: You know what I mean.\nShrek: Oh, you can't tell me you're afraid of heights?\nDonkey: No, I'm just uncomfortable about being on a rickety bridge over a boiling lake of lava!",
            "[Shrek burps in front of Donkey and Fiona]\nThe Donkey: Shrek!\nShrek: What? It's a compliment. Better out than in, I always say.\nThe Donkey: But that's no way to behave in front of a princess.\n[Fiona burps louder]\nPrincess Fiona: Thanks.\nThe Donkey: [to Shrek] She's as nasty as you are.",
            "Pinocchio: I'm not a puppet, I'm a real boy!\n[nose grows]\nCaptain of Guards: Five shillings for the possessed toy. Take it away.",
            "Donkey: ...And then one time I ate some rotten berries. Man, there were some strong gases seepin' outta my butt that day!",
            "The Donkey: All right, I hope you heard that? She called me a \"noble steed.\" She thinks I'm a steed.",
            "[Shrek bursts into Fiona's and Farquaad's wedding]\nLord Farquaad: Now really, it's rude enough being alive when no one wants you, but showing up uninvited to a wedding?",
            "Donkey: All right, nobody move! I've got a dragon and I'm not afraid to use it! I'm a donkey on the edge!",
            "Shrek: Does anyone know where this Farquaad guy is?\n[Donkey jumps up and down, shouting out]\nDonkey: Oh, I know! I know where he is!\nShrek: Does anyone ELSE know where to find him?\nDonkey: Pick me! Pick me! Me! Me!",
            "Shrek: [to Donkey] I already told you, didn't I? You're not coming home with me! I live alone! MY swamp! ME! Nobody else, understand? NOBODY! Especially useless, pathetic, annoying, TALKING *DONKEYS*!\nDonkey: But... I thought...\nShrek: Yeah, well, you know what? You thought wrong.",
            "[eyeing the \"KEEP OUT\" signs surrounding Shrek's home]\nDonkey: I guess you don't, uh... entertain much, do you?\nShrek: I like my privacy.\nDonkey: Y'know, I do too. That's another thing we have in common. I hate it when you've got someone in your face, you try to give someone a hint and they won't leave, and then there's that big awkward silence, y'know?\n[big awkward silence ensues]\nDonkey: Can I stay with you?\nShrek: What?\nDonkey: Can I stay with you... *please?*\nShrek: Of course!\nDonkey: Really?\nShrek: No.\nDonkey: Please! I don't wanna go back there, you don't know what it's like to be treated as a freak!... Well, maybe you do... but that's why we gotta stick together! You gotta let me stay! Please! PLEASE!",
            "[Shrek discovers the seven dwarves have placed Snow White on his kitchen table]\nShrek: Oh, no no no no! Dead broad OFF the table!\nDwarf: Well, where are we supposed to put her? The bed's taken!\nShrek: Huh?\n[rushes over to his bed to find...]\nBig Bad Wolf: What?",
            "Donkey: Okay, let me get this straight: you gonna go fight a dragon and rescue a princess just so Farquaad'll give you back your swamp, which you only don't have 'cause he filled it full of freaks in the first place. Is that about right?\nShrek: You know what? Maybe there's a good reason donkeys shouldn't talk.",
            "Shrek: Go over there and see if you can find any stairs.\nDonkey: Stairs? I thought we was lookin' for the Princess.\nShrek: The Princess will be up the stairs in the highest room in the tallest tower.\nDonkey: How do you know that?\nShrek: I read it in a book once.\nDonkey: Cool! You handle the dragon, I'll handle the stairs!",
            "Shrek: Um... Princess?\nPrincess Fiona: Yes... Shrek?\nShrek: I... um... I was wondering... are you... um... are you going to eat that?",
            "[Fiona notices it's sunset]\nPrincess Fiona: [uneasy] Shouldn't we stop to make camp?\nShrek: No, that'll take longer. We can keep going.\nPrincess Fiona: But, there's... ROBBERS, in the woods!\nDonkey: Whoa! Time out, Shrek! Camp is definitely starting to sound good!\nShrek: Hey, come on, I'm scarier than anything we're gonna meet in this forest...\nPrincess Fiona: [in Shrek's face] I need to find somewhere to camp NOW!",
            "Shrek: Thank you, thank you very much. I'm here 'til Thursday. Try the veal.",
            "[Shrek and Donkey are crossing a wooden bridge over a moat of lava]\nDonkey: Don't look down, don't look down, don't look down, keep on moving, don't look down...\n[a board under Donkey breaks, prompting Donkey...]\nDonkey: Shrek, I'm looking down!",
            "[Donkey and Shrek are looking at constellations in the night sky]\nThe Donkey: So, uh, are there any donkeys up there?\nShrek: Well, there's, um, Gabby, the Small and Annoying.\nThe Donkey: Okay, okay, I see it now. The big shiny one, right there. That one there?\nShrek: That's the moon.\nThe Donkey: Oh, okay.",
            "Shrek: Fiona? Are you all right?\n[Fiona looks at herself, and sees she is still an ogre]\nPrincess Fiona: Yes. But, I don't understand. I'm supposed to be beautiful.\nShrek: But you are beautiful.\nDonkey: I was hoping this would be a happy ending...\n[Shrek and Fiona kiss]",
            "Donkey: Okay, so here's another question: Say there's a woman who digs you, right, but you really don't like her THAT quick - now how do you let her down real easy so her feelings aren't hurt, but you don't get burned to a crisp and eaten? How do you do that?\nPrincess Fiona: Just tell her she's not your true love!",
            "Donkey: Oh, now I really see what's going on...\nShrek: I don't know what you're talking about...\nDonkey: Hey, I don't even wanna hear... Look, I'm an animal, I got instincts, and I know you two were diggin' on each other!\nShrek: Oh, you're crazy! I'm just bringing her back to Farquaad!\nDonkey: Oh, come on, Shrek, wake up and smell the pheromones! Just go in there and tell her you how you feel!\nShrek: Arrgh! There's nothing to tell! Even if I DID have... I'm not saying I am, 'cause I don't... she's a princess! And I'm...\nDonkey: An ogre?\nShrek: Yeah. An ogre.\n[walks away]\nDonkey: Where're you going?\nShrek: To get... more firewood.\n[Donkey looks askance at a full pile of firewood]",
            "Donkey: Wow, that was really scary. And if you don't mind me saying, if that don't work your breath will certainly get the job done, cause you definitely need some Tic Tacs or something cause your breath STINKS!",
            "Donkey: I just know, before this is over, I'm gonna need a whole lot of serious therapy. Look at my eye twitchin'.",
            "[Princess Fiona has just defeated Monsieur Hood and his Merry Men single-handed]\nPrincess Fiona: Well, when one lives alone, one has to learns these things in case there's...\n[points]\nPrincess Fiona: There's an arrow in your butt!\nShrek: What?\n[looks at arrow]\nShrek: Oh, would you look at that?",
            "Princess Fiona: I wanted to show you before...\n[turns into an ogre]\nShrek: Well... er... THAT explains a lot.\nLord Farquaad: [revolted] It's disgusting!",
            "Shrek: So... what did Fiona say about me?\nDonkey: Ah, what're you asking me for? Why don't you go and ask her!\nShrek: The wedding! We'll never make it in time!\nDonkey: Ha-ha-ha! Never fear! Where there's a will, there's a way. And I have a way.\n[blows a whistle, and Dragon appears in the sky; an overjoyed Shrek grabs Donkey and cuddles him]\nDonkey: All right, all right, that's enough. No one likes a kiss-ass.",
            "Captain of Guards: What have you got?\nOld Woman: Well, I have a talking donkey.\nCaptain of Guards: Really? Well, that's good for ten shillings... if you can prove it.\nOld Woman: Go ahead, little fella.\n[Donkey says nothing]\nCaptain of Guards: Well?\nOld Woman: He's just a little nervous. He's really quite the chatterbox. Talk, you boneheaded dolt...\nCaptain of Guards: That's it, I've heard enough. Guards?\nOld Woman: No, no! He talks. He does...\n[moves Donkey's mouth while trying to throw her voice]\nOld Woman: I can talk. I love to talk. I'm the talkingest damn thing you ever saw.\nCaptain of Guards: Get her out of my sight!",
            "Baby Bear: This cage is too small.",
            "Princess Fiona: You're an ogre...\nShrek: Oh, you were expecting Prince Charming?\nPrincess Fiona: Well, yes, actually. Oh... this is wrong. This is all wrong! It's not supposed to be an ogre!",
            "Shrek: Donkey? What are you doing?\nDonkey: [gathering branches] I would think YOU of all people would recognize a wall when you saw one!\nShrek: Well, yeah... but the wall's supposed to go AROUND my swamp, not through it!\nDonkey: It is around your swamp! That's your half and this's mine!\nShrek: Oh, your half! Hmmm!\nDonkey: Yes, MY half! I helped rescue the Princess! I did half the work, I get half the booty! Now hand over that big rock, the one that looks like your head!",
            "[Shrek rescues Fiona]\nPrincess Fiona: What are you doing? You know, you should sweep me off my feet out yonder window and down a rope onto your valiant steed.\nShrek: You've had a lot of time to plan this, haven't you?\nPrincess Fiona: [nods] Mmmh-hmm",
            "The Donkey: Wait a minute, I know what's going on. You're afraid of the dark.\nPrincess Fiona: Why... yes!\nThe Donkey: Don't worry, princess. I used to be afraid of the dark until... No, wait. I'm still afraid of the dark.",
            "The Donkey: [waking up] Uh... What'd I miss? What'd I miss?\n[suddenly notices the guards walking by]\nThe Donkey: [trying to throw his voice] Who said that? Couldn't have been the donkey.",
            "Shrek: I live in a swamp! I put up signs! I'm a terrifying ogre! What do I have to do to get a little privacy?",
            "Lord Farquaad: I will have order! I will have perfection! I will have...\n[gets eaten by Dragon]",
            "[Thelonius dunks the Gingerbread Man in a glass of milk]\nLord Farquaad: That's enough! He's ready to talk.",
            "Shrek: Okay, you two, head for the exit!\n[Fiona and Donkey run, Shrek grabs a sword]\nShrek: I'll take care of the Dragon...",
            "Wrestling Fan: [watching Shrek fight in a wrestling ring] The chair! Give him the chair!",
            "Gingerbread Man: God bless us, everyone!",
            "Captain of Guards: [to Shrek, after finding him and Donkey in the woods] You there! Ogre!\nShrek: Aye?\nCaptain of Guards: [to both Shrek and Donkey] By the order of Lord Farquaad, I am authorized to place you both under arrest and transport you to a designated resettlement facility.\nShrek: Oh, really? You and what army?\n[the Captain looks behind him and notices that his soldiers have run away, leaving their spears behind. He does the same]",
            "Shrek: Um... Fiona?\nPrincess Fiona: Yes, Shrek?\nShrek: I... I love you.\nPrincess Fiona: Really?\nShrek: Really, really!\nPrincess Fiona: Mmmm... I love you too.\n[they kiss. Thalonius writes \"Awwww\" on a cue card for the audience. Fiona floats up in the air and her enchantment breaks in a blaze of light...]",
            "[Monsieur Hood abducts Fiona]\nShrek: Hey, that's my princess! Go find your own!",
            "[staring up at the starry night]\nShrek: [pointing at a constellation] ... and that one, that's Throwback, the only ogre to spit over three wheat fields.\nDonkey: Okay, I see it. Hey, Shrek, can you tell my future from these stars?\nShrek: Well, the stars don't tell the future, Donkey, they tell stories. That one is Bloodnok, the Flatulent. You can guess what HE's famous for...\nDonkey: Okay, now I know you're making that up!\nShrek: [pointing] No! See, that's him, and this is the group of hunters running away from his stench.\nDonkey: Man, that ain't nothing but a bunch of little dots.\nShrek: You know, Donkey, things are more than what they seem, hmm?... Forget it.\n\n",
            "Lord Farquaad: Princess Fiona... she's perfect!",
            "[a squad of archers aim at Shrek]\nCaptain of Guards: Shall I give the order, my Lord?\nLord Farquaad: No. I have a better idea...",
            "Captain of Guards: [snaps a witch's broomstick in half] Your flying days are over!",
            "Princess Fiona: [Shrek interrupts her and Farquaad's wedding] What are you doing here?\nLord Farquaad: Really, it's rude enough being alive when no one wants you, but showing up uninvited to a wedding...\nShrek: Fiona! I need to talk to you.\nPrincess Fiona: Oh, now you wanna talk? Well, it's a little late for that, so if you'll excuse me...\nShrek: But you can't marry him.\nPrincess Fiona: And why not?\nShrek: Because... because he's just marrying you so he can be king.\nLord Farquaad: Outrageous! Fiona, don't listen to him.\nShrek: He's not your true love.\nPrincess Fiona: And what do you know about true love?\nShrek: Well, I... uh... I mean...\nLord Farquaad: Oh, this is precious.\n[chuckling]\nLord Farquaad: The ogre has fallen in love with the princess! Oh, good Lord.\n[signaling his guards, one of them holds up a cue card reading \"Laugh\", and the attendees roar with laughter]\nLord Farquaad: An ogre and a princess!\nPrincess Fiona: Shrek, is this true?\nLord Farquaad: Who cares? It's preposterous! Fiona, my love, we're but a kiss away from our happily ever after. Now kiss me!",
            "[Blind Mouse is on Shrek's shoulder, sniffing]\nBlind Mouse: I found some cheese.\n[Blind Mouse bites Shrek in the ear]\nShrek: Ow!\nBlind Mouse: Ugh! Awful stuff.",
            "Lord Farquaad: [Shrek has barged into the tournament] Knights, new plan! The one who kills the ogre, will be named champion! Have at him!\n[all the knights draw their weapons and converge on Shrek]\nShrek: Okay, now... can't we just settle this over a pint!\n[holds up a friendly mug, to no avail]\nShrek: No? All right then! COME ON!\n[He bursts one of the ale barrels]",
            "Lord Farquaad: [Fiona reveals herself to be an ogre, too] This hocus-pocus alters nothing. This marriage is binding, and that makes me king!",
            "Princess Fiona: [an arrow is stuck in Shrek's butt] Now you hold still, and I'll yank this thing out.\nShrek: [jumping in pain] Ow! Hey! Easy with the yankin'.\nPrincess Fiona: Well, I'm sorry, but it... but it has to come out.\nShrek: No, no, it's tender.\n[she continues to try and remove it while he tries to stop her]\nPrincess Fiona: Now, hold on.\nShrek: Would... would you... what you're doing is the opposite of help.",
            "Shrek: I'm sorry. I guess I am just a big, stupid, ugly ogre. Can you forgive me?\nDonkey: Hey, that's what friends are for, right?\nShrek: Right. Friends?\nDonkey: Friends.",
            "[At the slop, Fiona slides down and she is happy about being rescued]\nPrincess Fiona: You did it! You rescued me! You're amazing. You're... You're wonderful. You're...\n[turns and sees Shrek fall down the slop and bump into Donkey]\nPrincess Fiona: A little unorthodox, I'll admit. But thy deed is great, and thine heart is pure. I am eternally in your debt.\n[Donkey clears his throat]\nPrincess Fiona: And where would a brave knight be without his noble steed?\nDonkey: All right, I hope you heard that. She called me a noble steed. She think I'm a steed.",
            "Lord Farquaad: [Slowly and dramatically to the looking glass] Magic... mirror... on... the wa...\nGingerbread Man: DON'T TELL HIM ANYTHING!",
            "Shrek: What are you doing in my swamp?",
            "Donkey: What's the point of being able to talk if you gotta keep secrets?",
            "Donkey: Please don't turn me in. I'll never be stubborn again. I can change. PLEASE! Give me another chance!\nOld Woman: Oh, shut up.\n[she slaps him]\nDonkey: Oh!\nCaptain of Guards: Next!",
            "Monsieur Hood: [swings in to grab Fiona] La liberte! Hey!\nShrek: Princess!\nPrincess Fiona: What are you doing?\nMonsieur Hood: Be still, mon cherie, for I am your savior! And I am rescuing you from this green - -\n[kissing sounds]\nMonsieur Hood: - -beast.\nShrek: Hey! That's my princess! Go find your own!\nMonsieur Hood: Please, monster! Can't you see I'm a little busy here?\nPrincess Fiona: Look, pal, I don't know who you think you are!\nMonsieur Hood: Oh! Of course! Oh, how rude. Please let me introduce myself. Oh, Merry Men.\n[laughs]",
            "Donkey: Alright. Alright. Don't get so sloppy. No one likes a kiss ass.",
            "Donkey: Celebrity marriages. They never last, do they?"
        ]
    },
    "shrek_2": {
        "id": 1,
        "name": "Shrek 2",
        "year": 2004,
        "quotes": [
            "Shrek: Quick, tell a lie!\nPinocchio: What should I say?\nDonkey: Say something crazy, like, \"I'm wearing ladies underwear!\"\nPinocchio: I'm wearing ladies underwear.\nPinocchio: [silence]\nShrek: Are you?\nPinocchio: I most certainly am not!\nPinocchio: [nose extends]\nDonkey: It looks like you most certainly am are!\nPinocchio: I am not!\nPinocchio: [nose extends]\nPuss-in-Boots: What kind?\nGingerbread Man: IT'S A THONG!",
            "[after drinking a beauty potion]\nDonkey: I don't *feel* any different. Do I look any different?\nPuss-in-Boots: You still look like an ass to me.",
            "Donkey: Oh, Shrek. Don't worry. Things just seem bad because it's dark and rainy and Fiona's father hired a sleazy hitman to whack you.",
            "Donkey: What about my Miranda rights? You're supposed to say, \"You have the right to remain silent.\" Nobody said I have the right to remain silent!\nShrek: Donkey, you HAVE the right to remain silent. What you lack is the capacity.\nPuss-in-Boots: [camera shows just Puss] I must hold on before I, too, go totally mad.\nGingerbread Man: Shrek? Donkey?\nPuss-in-Boots: [looks up to see fairy tale creatures above him] Too late.\nShrek: Gingy! Pinocchio! Get us out of here!",
            "Puss-in-Boots: Stop, ogre! I have misjudged you.\nShrek: Join the club. We got jackets.",
            "[Shrek, Fiona, Fiona's Mom and Dad and Donkey are arguing at the table]\nQueen: Harold!\nPrincess Fiona: Shrek!\nShrek: Fiona...\nKing: Fiona!\nPrincess Fiona: Mom!\nQueen: Harold!\nDonkey: [happily] Donkey!",
            "Receptionist: Look, she's not seeing any clients today. Okay?\nShrek: That's okay, buddy. We're from the union.\nReceptionist: The union?\nShrek: We represent the workers in all magical industries, both evil and benign.\nReceptionist: Oh, of course.\nShrek: Are you feeling at all degraded or oppressed?\nReceptionist: A little. We don't even have dental.\nShrek: They don't even have dental. Okay, we're gonna have a look around. And buddy, it would be better if the Fairy Godmother doesn't know about this. Know what I mean? Hmm?\nDonkey: Hmm?\nShrek: Hmm?\nDonkey: Huh? Huh? Huh?\nShrek: Stop it.",
            "Shrek: Donkey, think of the saddest thing that's ever happened to you.\nDonkey: Oh, man! Where do I begin? First there was the time the farmer traded me for some magic beans. I ain't never gotten over that. Then this fool went off and had a party, and they all starting trying to pin a tail on me. Then they all got drunk, and started hitting me with sticks, yelling \"Piñata! Piñata!\" What is a piñata, anyway?\nShrek: No, Donkey! I need you to cry.",
            "Captain of the Guards: Catnip...\nPuss-in-Boots: That's, uh, not mine...",
            "Puss-in-Boots: I hate Mondays.\nDonkey: [disgusted, to Shrek] I can't believe you're just gonna walk away from the best thing that ever happened to you.",
            "King: Who on earth are they?\nQueen: I think that's our little girl!\nKing: That's not little, that's a really big problem! Wasn't she supposed to kiss Prince Charming and break the spell?\nQueen: Well, he's no Prince Charming, but they do look...\nShrek: Happy now? We came, we saw them. Now let's go before they light the torches!\nPrincess Fiona: But they're my parents!\nShrek: Hello, they locked you in a tower!\nPrincess Fiona: Hey, that was for my own...\nKing: Good! Now's our chance. Let's go back inside and pretend we're not home.\nQueen: Harold! We have to be...\nShrek: Quick, while they're not looking, we can make a run for it!\nPrincess Fiona: Shrek! Stop it! Everything is going to be...\nKing: A disaster! There's no way...\nPrincess Fiona: You can do this.\nShrek: But I really...\nKing: Really...\nQueen: Really...\nShrek: Don't...\nPrincess Fiona: Want...\nQueen: To...\nShrek: Be...\nKing: He-ere.",
            "Donkey: You got a puppy? All I got in my room was shampoo.",
            "Donkey: I don't wanna die! I don't wanna DIE! Oh, sweet sister mother of mercy! I'm melting! I'M MEEELTIIING!\nShrek: It's just the rain, Donkey.",
            "Donkey: [singing] The sun will come out tomorrow, bet your bottom...\n[trails off]\nShrek: Bet my bottom?\nDonkey: I'm coming Elizabeth!\n[passes out]",
            "Donkey: [singing] Head 'em up, Head 'em up, Move 'em on, Move 'em on, Head 'em up, Rawhide! Line 'em up, Move 'em on, Head 'em up, Head 'em up, Move 'em on, Rawhide! Knock 'em out, Pound dead, Make 'em tea, Buy 'em drinks, Meet their mommas, Milk 'em hard, RAWHIDE! HEE-HAW!",
            "Donkey: [to Puss-in-Boots] I'm sorry, the position of annoying talking animal has already been taken.",
            "Shrek: Oh, look! A little cat.\n[Puss-in-Boots brandishes his sword]\nDonkey: Look out, Shrek! He got a piece!\nShrek: It's a cat, Donkey.",
            "[opening lines]\nPrince Charming: Once upon a time, in a kingdom far, far away, the king and queen were blessed with a beautiful baby girl, and throughout the land everyone was happy, until the sun went down, and they saw that their daughter was cursed with a frightful enchantment that took hold each and every night. Desperate, they sought the help of a fairy godmother, who had them lock the young princess away in a tower, there to await the kiss of the handsome Prince Charming. It was he who would chance the perilous journey through blistering cold and scorching desert, traveling for many days and nights, risking life and limb to reach the dragon's keep, for he was the bravest, and most handsome in all the land, and it was destiny that his kiss would break the dreaded curse. He alone would climb to the highest room of the tallest tower to enter the princess's chambers, cross the room to her sleeping silhouette, pull back the gossamer curtains to find her-\n[Charming gasps at the sight of the Big Bad Wolf]\nWolf: What?\nPrince Charming: Princess... Fiona?\nWolf: NO!\nPrince Charming: Oh, thank heavens! Where is she?\nWolf: She's on her honeymoon.\nPrince Charming: Honeymoon? With whom?",
            "Donkey: Are we there yet?\nShrek: Yes.\nDonkey: Really?\nShrek: No!",
            "Donkey: [carriage runs over Donkey] Oh, God! help me, please! My racing days are over! I'm blind! I'm blind! Tell the truth. Will I ever be able to play the violin again?",
            "Donkey: Shrek and I drank this potion and well, now... we're sexy!",
            "Shrek: [about the trumpeters and messenger who gave Shrek and Fiona the invitation] How do you explain Sgt. Pompous and the Fancy Pants Club Band?",
            "[after discovering Shrek must kiss his true love for his transformation to be permanent]\nMaiden #1: Oh, pick me. I'll be your true love!\nJill: I'll be your true love.\nMaiden #2: I'll be true... enough.",
            "[Shrek steals two noblemen's clothes]\nShrek: Thank you, gentlemen. Someday I will repay you, unless of course I can't find you, or if I forget.",
            "Puss-in-Boots: [trying to convince Shrek not to neuter him] Please, no, por favor, por favor, please no, I implore you. I was doing it for my family! My mother she's sick and my father he lives off the garbage. The king offered me much money and I have a little brother...",
            "Princess Fiona: Shrek?\nPuss-in-Boots: For you, baby, I could be.\nDonkey: Yeah, you wish!",
            "Donkey: [repeatedly] Are we there yet?",
            "Shrek: Donkey? you're a...\nDonkey: A stallion, baby! I can whinny!\n[whinnies]\nDonkey: I can count!\n[stomps his hoof]\nDonkey: Look at me, Shrek! I'm trotting!",
            "Shrek: The kingdom of FAR FAR Away, Donkey? That's where we're going! FAR, FAR away!",
            "Puss-in-Boots: Fear me, if you dare.",
            "[Harold takes the spell meant for Shrek, and is blasted until only his armour remains]\nPrincess Fiona: Oh, Dad...\nQueen: Harold...\nPinocchio: Is he... oh...\n[there's a \"ribbit\"]\nGingerbread Man: He croaked...\n[Harold, the Frog King, clambers out of his armour]\nQueen: ...Harold?\nPrincess Fiona: ...Dad?\nKing: [sighs] I had hoped you would never see me like this...\nDonkey: [to Shrek] Huh - and he gave *you* a hard time!\nShrek: Donkey!\nKing: No, no, he's right - I'm sorry, to both of you. I only wanted what was best for Fiona, but I can see now she already has it. Shrek, Fiona - will you accept an old frog's apologies, and my blessing?\n[Shrek and Fiona bow their heads in assent]\nQueen: Harold...\nKing: I'm sorry, Lillian - I just wish I could be the man that you deserve...\nQueen: [taking him in her hand] You're more that man today than you ever were - warts and all...",
            "Princess Fiona: I want what any princess wants - to live happily ever after... with the *ogre* I married.",
            "Puss-in-Boots: GO! GO! Your lady needs you. GO!\n[Shrek, Donkey and the gang head for the Royal Ball]\nPuss-in-Boots: Today, I repay my debt.\n[soldiers surround Puss as he slowly draws his weapon]\nPuss-in-Boots: EN GARDE!",
            "[the king enters Puss' room; it is dark, and only Puss' eyes and boots are visible]\nPuss-in-Boots: Who dares enter my room?\nKing: Sorry - I hope I'm not interrupting anything, but I was told that you are the one to handle an ogre problem.\nPuss-in-Boots: You are told correct, but for this I charge a great deal of money.\nKing: Will this do?\n[the king throws a bag full of money on the table; Puss opens it with his sword]\nPuss-in-Boots: You have engaged my valuable services, Your Majesty. Just tell me where I can find this ogre.",
            "Shrek: [to Donkey] For five minutes, could you not be yourself? FOR FIVE MINUTES!",
            "Shrek: That's it, Mongo! To the castle!\n[Mongo heads to the giant cup on top of Farbucks Coffee]\nShrek: No, no, no, no! You great stupid pastry! Come on!",
            "Fairy Godmother: He endured blistering winds and scorching deserts - he climbed the highest bloody room of the tallest bloody tower - and what does he find? Some gender-confused WOLF telling him that HIS princess is already married!\nKing: Well, it wasn't my fault - he didn't get there in time!",
            "Donkey: I mean, how good looking could this Prince Charming guy be anyway?\nThe Ugly Stepsister: Are you kiddin'? He's gorgeous! His face looks like it was carved by angels.\nPuss-in-Boots: Hmmm... he sounds dreamy.",
            "Puss-in-Boots: Pray for mercy from Puss... in boots.",
            "[hanging from Fairy Godmother's feet and looking up]\nPig: I see London, I see France...",
            "Donkey: [to Puss] If we ever need an expert on licking ourselves, we'll give you a call.",
            "[after Shrek, Donkey and Puss stumble upon a factory with multi-colored smokestacks]\nDonkey: Oh, no! That's the old Keebler's place! Let's just walk away slowly.\nPuss-in-Boots: That's the Fairy Godmother's cottage. She is the largest producer of hexes and potions in the whole kingdom.\nShrek: So why don't we drop in for a spell? Ha, ha! Spell!",
            "Chef: Bon appétit!\nDonkey: Oh, Mexican food! My favorite.",
            "Fairy Godmother: Harold, you have forced me to do something I really don't want to do.\nKing: What... Where are we?\nFast Food Clerk: Well, hi there! Welcome to Friar's Fat Boy. May I take your order?\nFairy Godmother: My diet is ruined! I hope you're happy.",
            "Princess Fiona: They just want to give us their blessing.\nShrek: Oh, great! Now I need their blessing?\nPrincess Fiona: Well, if you want to be part of this family, yes.\nShrek: Who said I want to be part of this family?\nPrincess Fiona: Uh... you did? When you married me?\nShrek: Well, there's some fine print for ya.",
            "[trying to get Puss, Donkey accidentally kicks Shrek in the groin]\nDonkey: Did I miss?\nShrek: No. You got them.",
            "Blind Mouse: [muffled] Pardon me. Would you mind letting me go?\nShrek: What? Puss!\nPuss-in-Boots: [spits Blind Mouse out] Sorry, boss.\nShrek: Quit messing around! We've got to stop that kiss!",
            "[Shrek is depressed because Fiona's father wants to kill him]\nDonkey: Oh, don't feel bad, Shrek. Almost everybody who meets you wants to kill you.",
            "Gingerbread Man: It looks like we're up chocolate creek without a Popsicle stick!",
            "[Puss is watching Shrek and Fiona]\nPuss-in-Boots: Whatever happens... I must not cry. You cannot make me cry...\n[breaks down sobbing]",
            "Cedric: Can I help you, your majesty?\nKing: Ah, yes, um... Mmm, exquisite. What do you call this dish?\nCedric: That would be the dog's breakfast, your majesty.\nKing: Ah, yes! Very good, uh... Carry on, Cedric.",
            "King: [Donkey sits at the table] No, no! Bad donkey! Bad! Down!\nPrincess Fiona: Dad, it's alright, it's alright. He's with us. He helped rescue me from the dragon.\nDonkey: Yup, that's me, the noble steed. Hey waiter! How 'bout a bowl for the steed?",
            "Fairy Godmother: We have to go. I have to do Charming's hair. You know, he's all high in the front and he can't reach the back. He always needs someone to take care of the back.\nPrince Charming: Oh, thank you, Mother.\nDonkey: [outside window] Mother?\nShrek: Uh... Mary! A talking horse!\nFairy Godmother: The ogre!",
            "Queen: So, Fiona. Tell us about where you live.\nPrincess Fiona: Well, Shrek owns his own land. Don't you, honey?\nShrek: Yes. It's in an... enchanted forest, abundant in squirrels, and cute little duckies...\nDonkey: What?\n[laughs]\nDonkey: I know you ain't talking about the swamp.\nShrek: Donkey!\nKing: An ogre from a swamp. How original.\nQueen: I guess that will be a fine place to raise the children.\n[both Shrek and the King choke; Shrek coughs up his spoon]\nShrek: It's a little early to be thinking about that, isn't it?\nKing: Indeed! I just started eating.\nQueen: Harold!\nShrek: What's that supposed to mean?",
            "Princess Fiona: Is that glitter on your lips?\nPrince Charming: Mmm, cherry flavored. Want a taste?",
            "Fairy Godmother: I don't care whose fault this was, just get this place cleaned up! And could someone please bring me something deep fat fried and smothered in chocolate!",
            "Donkey: Pray for mercy, from Puss!\nPuss-in-Boots: And Donkey!",
            "[King Harold turns up with two cups of tea - the one for Fiona filed with love potion...]\nKing: Darling? Ah, I thought I might find you here - how about a nice hot cup of tea before the ball...\nPrincess Fiona: I'm not going.\nKing: B-b-but the whole kingdom's turned out to celebrate your marriage!\nPrincess Fiona: There's just one problem - that's not my husband. I mean, look at him!\n[they both watch Charming, showing off in front of everyone]\nKing: Yes, he is a bit different, but people do change for the ones they love - you'd be surprised how much I changed for your mother...\nPrincess Fiona: *Change*? He's completely lost his mind!\nKing: Darling, why not come down to the ball and give him another chance - I mean, you might find you like this new Shrek...\nPrincess Fiona: But it's the *old* one I fell in love with, Dad - I'd give anything to have him back...\n[she reaches for her tea...]\nKing: [taking her cup] Darling, that's mine! Decaf... otherwise I'm up all night!\n[Fiona drinks the normal cup of tea]\nPrincess Fiona: Mmm. Thanks.",
            "Shrek: Face it, Donkey. We're lost.\nDonkey: We can't be lost. We followed the king's instructions to the letter. What did he say? Go to the deepest, darkest part of the forest.\nShrek: Aye.\nDonkey: Go past the sinister-looking trees with the scary-looking branches.\nShrek: Uh-huh.\nDonkey: And there's that bush that looks like Shirley Bassey.\nShrek: We passed that bush three times already!\nDonkey: Well, I wasn't the one who refused to stop for directions.",
            "Donkey: [from their hiding place] Get your fine Corinthian footwear and your cat cheeks out of my face!",
            "[Donkey collapses in a dead faint]\nPuss-in-Boots: Hey, boss. Let's shave him.",
            "[Shrek has grabbed Puss-in-boots]\nDonkey: I say we take the sword and neuter him right here! Give him the Bob Barker treatment!",
            "Pinocchio: I'm a real boy!",
            "[convincing Donkey to let Puss come with them]\nShrek: How many cats can wear boots? Honestly?...",
            "Puss-in-Boots: Ah-ha-ha!...\n[cough - hack - cough]\nPuss-in-Boots: He he... Hairball.\nDonkey: Oh, that is nasty!",
            "[to handsome Shrek]\nMaiden #1: You're so tense.\nJill: I want to rub his shoulders.\nMaiden #1: I got it covered. Thanks.\nMaiden #2: I don't have anything to rub.\nJill: Well, get in line.",
            "Donkey: [after turning back into a donkey] Aaaaaaw.\nShrek: Hey? You still look like a noble steed to me.",
            "Gingerbread Man: I hate these ball shows. They bore me to tears! Flip over to Wheel of Torture.\nPinocchio: I'm not flipping anywhere, Sir, until I see Shrek and Fiona.",
            "Shrek: A cute button nose? Thick, wavy locks? Taut, round buttocks? I'm-I'm...\nJill: Gorgeous!\nMaiden #1: I'll say.",
            "Shrek: Puss, do you think you could get up there?\nPuss-in-Boots: No prolema, boss - in one of my nine cat lives I was the great cat burglar Santiago de Compostela!",
            "Shrek: Look out, princess. Here comes the new me.\n[his pants fall down]\nDonkey: First things first. We need to get you out of those clothes.\n[the maidens gasp with delight]",
            "Princess Fiona: You're acting like a... a...\nShrek: Go on, say it.\nPrincess Fiona: Like an ogre!\nShrek: Well, guess what? Whether your parents like it or not, I *am* an ogre!\n[roars at the dog to shut it up]\nShrek: And guess what, princess? That's not about to change.\nPrincess Fiona: I've made changes for you, Shrek. Think about that.\n[she leaves]\nDonkey: That's real smooth, Shrek. \"I'm an ogre! Arrr!\"",
            "[Dragon flies up with her and Donkey's children]\nDonkey: Look at our little mutant babies!\n[screen goes black]\nDonkey: I gotta get a job!",
            "[to Donkey, when Shrek, Donkey, and Puss are at a bar]\nThe Ugly Stepsister: Why the long face?",
            "Shrek: Hi. I'm here to see...\nReceptionist: The Fairy Godmother? I'm sorry, she's not here right now.\nFairy Godmother: [on intercom] Jerome! Coffee and a Monte Cristo! Now!",
            "Shrek: TGIF, eh, buddy? Working hard or hardly working, eh, mac?",
            "Donkey: [running ahead of giant gingerbread man] Run, run, run as fast as you can!",
            "Donkey: I'm a stallion, baby!",
            "Fairy Godmother: Harold, you were supposed to give her the potion!\nKing: Well, I guess I gave her the wrong tea.",
            "Donkey: You know, in some cultures, donkeys are revered as the smartest of animals, especially us talking ones.",
            "King: So I suppose any grandchildren I could expect from you would be...\nShrek: Ogres! Yes!\nQueen: Not that there's anything wrong with that. Right, Harold?\nKing: Oh, no, no. Of course not! That's assuming you don't eat your own young!\nPrincess Fiona: Dad!\nShrek: Oh, no, we usually prefer the ones who have been locked away in a tower!\nPrincess Fiona: Shrek, please!\nKing: I only did that because I love her!\nShrek: Oh, aye! Daycare or dragon-guarded castle!\nKing: You wouldn't understand that you're not her father!",
            "Puss-in-Boots: [to Shrek] I too was concocting this very same plan, already our minds are becoming one!",
            "Fairy Godmother: Your fallen tears have called to me / So here comes my sweet remedy / I know what every princess needs / For her to live life happily / With... just a wave of my magic wand / Your troubles will soon be gone / With a flick of the wrist in just a flash / You land a prince with a ton of cash / A high priced dress made by mice no less / Some crystal glass pumps and almost dressed / Worries will vanish your soul will cleanse / Confide in your very own furniture friends / We'll help you set a new fashion trend / I'll make you fancy, I'll make you great / The kind of gal a prince would date / They'll write your name on the bathroom wall...\nBookcase: For happy ever after, give Fiona a call!\nFairy Godmother: A sporty carriage to ride in style / A sexy man-boy chauffer Kyle / Vanish your blemishes, tooth decay / Celulite thighs will fade away / And oh, what the hey? / Have a Bichon Frise / Nip and tuck here and there / To land that prince with the perfect hair / Lipstick liners, shadow blush / To get that prince with a sexy tush / Lucky day, hunk buffet / For the lipstick a roll in the hay / You can spoon on the moon / With the prince to this tune / Don't be drab, you'll be fab / Your prince will have rock-hard abs / Cheese souflee Valentine's Day? / Have some chicken fricassee...",
            "Mirror: Well, the abs are fab and it's gluteus to the maximus here at the Far Far Away royal ball. The carriages are all lined up as the cream of the crop pours out of them like Miss Muffet's curds and whey.",
            "The Ugly Stepsister: [approaching Prince Charming] Hello, Gorgeous.",
            "[as Shrek and Harold get into a fight]\nDonkey: I got to go to the bathroom...\nChef: Dinner is served!\nDonkey: Never mind. I can hold it.",
            "Shrek: Fiona's father paid you to do this?\nPuss-in-Boots: The rich king? Sí.",
            "Mongo: [drowning] Be good.",
            "Puss-in-Boots: [gets a look from Shrek and Donkey after agreeing Shrek should be a Prince Charming] Sorry. I thought that question was directed at me.",
            "Donkey: It's gonna be champagne wishes and caviar dreams from now on.",
            "Fairy Godmother: What in Grimm's name are you doing here?\nShrek: It seems that Fiona is not at all happy.\nFairy Godmother: Oh, and is there any question as to why that is? Let's explore that, shall we?\n[looks over her bookshelf]\nFairy Godmother: Let's see... P-p-p-p-p, Princess. Cinderella... Handsome prince, lived happily ever after... oh, no ogres! Sleeping Beauty... handsome prince, no ogres. Thumbelina, no! Handsel and Gretel, no! The Golden Bird, the Little Mermaid, Pretty Woman... no, no, no, no, NO! You see, ogres don't live happily ever after...\nShrek: Alright! Look, lady...\nFairy Godmother: DON'T YOU POINT THOSE DIRTY GREEN SAUSAGES AT ME!",
            "Shrek: Aww, come one, Donkey, look at him, in his wee lil' boots! I mean, how many cats can wear boots? Honestly?",
            "Fairy Godmother: Don't you point those dirty, green sausages at me!",
            "Prince Charming: [waving his sword] Where is he Mum? I shall render his head from his shoulders! I will smite him where he stands! HE WILL RUE THE VERY DAY HE STOLE MY KINGDOM AWAY FROM ME!\n[a bird sheds its droppings on him]\nFairy Godmother: Oh, put it away, Junior! You're still going to be King. We just need to work out something smarter, that's all.",
            "Prince Charming: Uh... FYI. Not my fault!",
            "Princess Fiona: [burps] Excuse me\nShrek: Better out than in, i always say ay, Fiona\n[Fiona and Shrek both giggle]",
            "King: Uh, excuse me, I'm looking for the Ugly Stepsister.\n[the Ugly Stepsister silently turns around to face Harold]\nKing: Ah, there you are, right. You see, I uh,\n[Harold lowers his voice]\nKing: I need to have someone 'taken care of'.\nThe Ugly Stepsister: Who's the guy?\nKing: Well, he's not guy per say, he's ogre.\n[the entire bar gasps at the word ogre and drops silent]\nThe Ugly Stepsister: Hey, buddy let me clue you in. There's only one fella who can handle a job like that, and frankly he don't like to be disturbed.\nKing: Where could I find him?",
            "Puss-in-Boots: Hey! Isn't we supposed to be having a fiesta?",
            "Gingerbread Man: Fire up the ovens, Muffin Man! We got a big order to fill.",
            "Gingerbread Man: IT'S ALIVE!",
            "Shrek: Do you still know the Muffin Man?\nGingerbread Man: Sure, he's down on Drury Lane. Why?\nShrek: Because we're going to need flour. Lots and lots of flour.",
            "Donkey: [after just being snuck up on by Puss In Boots, who steps on his hoof] Owww! You little hairy little licking sack of...\n[tear lands onto card]\nFairy Godmother: [\"Voice Message\" Bubble forms after landing] Is it on?, Is it on?\n[clears throat]\nFairy Godmother: What? Is it on? Is it on? This is Fairy Godmother. I'm either away from my desk or with a client, but if you come by the office, we'll be glad to give you a personal appointment. Have a Happy Ever After!\n[bubble pops]",
            "Donkey: [as he stands on an elevated stage with a mike] Puss and Donkey, y'all.",
            "Prince Charming: I'll have the Medieval Meal.",
            "Fairy Godmother: I told you ogres don't live happily ever after!",
            "Fairy Godmother: Remember, happiness is just a teardrop away...",
            "Fairy Godmother: [singing] I need a hero!",
            "[at the dinner table as dinner is served]\nQueen: Let's not sit here with our tummies rumbling. Everybody dig in.\nDonkey: Don't mind if I do, Lillian!",
            "[singing softly]\nFairy Godmother: Your fallen tears have come to me, so here comes my sweet remedy, I know what every princess needs, for her to live happily...",
            "[Shrek farts after he drinks the love potion] \nDonkey: Ooh! I think you might've drunk the Farty Ever After potion!",
            "King: I knew this would happen.\nQueen: You should. You started it.\nKing: I can hardly believe that, Lillian. He's the ogre. Not me.\nQueen: I think Harold, you're taking this a little too personally. This is Fiona's choice.\nKing: Yes, but she was supposed to choose the prince we picked out for her. I mean, you expect me to give my blessings to this thing?\nQueen: Fiona does. And she'll never forgive you if you don't. I don't want to lose our daughter again, Harold. Oh, you act as if love is totally predictable. Don't you remember when we were young? We used to walk down by the lily pond and they were in bloom.\nKing: Our first kiss. It's not the same! I don't think you realize that our daughter has married a monster!",
            "Fairy Godmother: You see we made a deal, Harold. And I assume you don't want me to go back on my part.\nKing: [sighs] Indeed not.\nFairy Godmother: So Fiona and Charming *will* be together!\nKing: Yes.\nFairy Godmother: Oh, believe me Harold. It's what's best. Not only for your daughter...\n[takes a bite out of her wrap]\nFairy Godmother: But for your kingdom.",
            "Fairy Godmother: It's time to stop living in a fairy tale, Shrek. She's a princess, and you're an ogre. That's something no amount of potion is ever going to change.\nShrek: But I love her.\nFairy Godmother: If you really love her... you'll let her go.",
            "Prince Charming: I mean, how charming can I be when I have to pretend I'm that dreadful ogre?\nKing: No, no, It's nobody's fault. Perhaps it's best if we just call the whole thing off, okay?\nPrince Charming, Fairy Godmother: What?\nKing: You can't force someone to fall in love!\nFairy Godmother: I beg to differ. I do it all the time!\n[pulls out a love potion from her bag]\nFairy Godmother: Have Fiona drink this and she'll fall in love with the first man she kisses, which will be Charming.\nKing: Um, no.\nFairy Godmother: What did you say?\nKing: I can't. I won't do it.\nFairy Godmother: Oh, yes, you will. If you remember, I helped you with your happily ever after.\n[holds her wand close to Harold's face]\nFairy Godmother: And I can take it away just as easily. Is that what you want? Is it?\nKing: No.\nFairy Godmother: Good boy.",
            "[Shrek, Donkey, Puss and the gang arrive at the Royal Ball just in time to try to prevent Prince Charming from kissing Fiona]\nShrek: Hey, YOU! Back away from my wife!",
            "Prince Charming: Mummy!\n[tosses the magic wand to his mother]\nPrincess Fiona: [confused] Mummy?\nFairy Godmother: [enraged, to Shrek] I TOLD YOU OGRES DON'T LIVE HAPPILY EVER AFTER!\n[fires a blast from her wand in a selfish attempt to kill Shrek]\nPrincess Fiona: [worried] SHREK!\nKing: NOOOOOO!\n[the blast from the wand is deflected off of the King's armour and hits the Fairy Godmother. Shocked, she wonders what hit her, and she makes another attempt to kill Shrek, but before she can fire another blast from her wand, she explodes into bubbles, dying in the process]",
            "Shrek: And who said I wanted to be part of this family?\nPrincess Fiona: Uh, YOU DID. When you married me.",
            "Donkey: Uh I gotta go to the bathroom\nChef: Dinner is served!\nDonkey: Never mind. I can hold it.",
            "Donkey: Did I Miss?\nShrek: No. You got them.",
            "Shrek: You know SHOCKINGLY this isn't making me feel any better"
        ],
        "top_cast": [
            {
                "name": "Mike Myers",
                "characters": [
                    "Shrek"
                ]
            },
            {
                "name": "Eddie Murphy",
                "characters": [
                    "Donkey"
                ]
            },
            {
                "name": "Cameron Diaz",
                "characters": [
                    "Princess Fiona"
                ]
            },
            {
                "name": "Julie Andrews",
                "characters": [
                    "Queen"
                ]
            },
            {
                "name": "Antonio Banderas",
                "characters": [
                    "Puss In Boots"
                ]
            },
            {
                "name": "John Cleese",
                "characters": [
                    "King"
                ]
            },
            {
                "name": "Rupert Everett",
                "characters": [
                    "Prince Charming"
                ]
            },
            {
                "name": "Jennifer Saunders",
                "characters": [
                    "Fairy Godmother"
                ]
            },
            {
                "name": "Aron Warner",
                "characters": [
                    "Wolf"
                ]
            },
            {
                "name": "Kelly Asbury",
                "characters": [
                    "Page",
                    "Elf",
                    "Nobleman",
                    "Nobleman's Son"
                ]
            },
            {
                "name": "Cody Cameron",
                "characters": [
                    "Pinocchio",
                    "Three Pigs"
                ]
            },
            {
                "name": "Conrad Vernon",
                "characters": [
                    "Gingerbread Man",
                    "Cedric",
                    "Announcer",
                    "Muffin Man",
                    "Mongo"
                ]
            },
            {
                "name": "Christopher Knights",
                "characters": [
                    "Blind Mouse"
                ]
            },
            {
                "name": "David P. Smith",
                "characters": [
                    "Herald",
                    "Man with Box"
                ]
            },
            {
                "name": "Mark Moseley",
                "characters": [
                    "Mirror",
                    "Dresser"
                ]
            },
            {
                "name": "Kelly Cooney Cilella",
                "characters": [
                    "Fast Food Clerk"
                ]
            },
            {
                "name": "Wendy Bilanski",
                "characters": [
                    "Bar Frog"
                ]
            },
            {
                "name": "Larry King",
                "characters": [
                    "Ugly Stepsister"
                ]
            },
            {
                "name": "Guillaume Aretos",
                "characters": [
                    "Receptionist"
                ]
            },
            {
                "name": "Chris Miller",
                "characters": [
                    "Humphries",
                    "Magic Mirror"
                ]
            },
            {
                "name": "Latifa Ouaou",
                "characters": [
                    "Doll",
                    "Jill"
                ]
            },
            {
                "name": "Alina Phelan",
                "characters": [
                    "Maiden #1",
                    "Generic Female #2"
                ]
            },
            {
                "name": "Erika Thomas",
                "characters": [
                    "Maiden #2"
                ]
            },
            {
                "name": "Joan Rivers",
                "characters": [
                    "Joan Rivers"
                ]
            },
            {
                "name": "Andrew Adamson",
                "characters": [
                    "Captain of the Guards"
                ]
            }
        ]
    },
    "shrek_the_third": {
        "id": 2,
        "name": "Shrek the Third",
        "year": 2007,
        "quotes": [
            "Prince Charming: You! You can't lie! So tell me puppet... where... is... Shrek?\nPinocchio: Uh. Hmm, well, uh, I don't know where he's not\nPrince Charming: You're telling me you don't know where Shrek is?\nPinocchio: It wouldn't be inaccurate to assume that I couldn't exactly not say that it is or isn't almost partially incorrect.\nPrince Charming: So you do know where he is!\nPinocchio: On the contrary. I'm possibly more or less not definitely rejecting the idea that in no way with any amount of uncertainty that I undeniably\nPrince Charming: Stop it!\nPinocchio: ...do or do not know where he shouldn't probably be, if that indeed wasn't where he isn't. Even if he wasn't at where I knew he was\n[Pigs and Gingerbread Man begin singing]\nPinocchio: That'd mean I'd really have to know where he wasn't.",
            "Donkey: Alright people, let's do this thing. Go Team Dynamite!\nPinocchio: But I thought we agreed we'd go by the name Team Super-cool.\nGingerbread Man: As I recall, it was Team Awesome.\nWolf: I voted for Team Alpha Wolf Squadron.\nDonkey: Alright, alright, alright. From henceforth, we're all to be known as Team Alpha Super Awesome Cool Dynamite Wolf Squadron.",
            "Snow White: Right! Ladies, assume the position!\n[Sleeping Beauty falls asleep, Snow White lies down in her coffin pose, and Cinderella seats herself on the floor gazing dreamily into space]\nPrincess Fiona: What are you doing?\nSleeping Beauty: [Snaps awake] Waiting to be rescued.\n[falls back asleep]",
            "Shrek: I can't believe I'm going to be a father. How did this happened?\nPuss in Boots: Allow me to explain. When a man falls in love with a woman, he is overcome with powerful urges...\nShrek: I know how it happened! I just can't believe it.\nDonkey: [to Puss] How does it happen?",
            "Snow White: Rapunzel, Rapunzel. Let down your golden extension.",
            "Cinderella: [after hearing the Puss and Donkey speak after changing bodies] I don't get it.\nSnow White: The cat turned into a little horse that smells like feet. What's to get?",
            "Puss in Boots: How can you be a reciever of the wedgies, when you are clearly not a wearer of the underpants?\nDonkey: Let's just say some things are better left unsaid.",
            "Shrek: Listen, Artie. Eh, if you think this whole mad scene ain't dope, I feel you, dude. I mean, I'm not trying to get up in your grill or raise your roof or whatever, but what I am screamin' is, yo, check out this kazing thazing, bazaby! I mean if it doesn't groove or what I'm sayin' ain't straight trippin' just say, \"Oh, no you di'n't! You know, you're gettin' on my last nerve.\" And then I'll know it's... then I'll - I'll know it's wack!\n[Shrek gets hit in the face with a branch that Artie had evidently pulled back]\nArtie: Somebody help! I've been kidnapped by a monster who's trying to relate to me!\n[knocks on the door of a tree incessantly]\nArtie: Knock, knock. Hello! Hello!\n[a holograph of Merlin emits from a crystal a few feet adjacent to the door]\nMerlin: Greetings, cosmic children of the universe. Welcome to my serenity circle. Please leave all bad vibes outside the healing vortex. Now prepare-\n[the holograph cuts off. Merlin comes out the front door and says]\nMerlin: I knew I should have got that warranty.",
            "Donkey: [Reading Sign] Wer-sestor-shiray? Sounds fancy!\nShrek: No, it's Worcestershire.\nDonkey: Like the Sauce? Spicy!",
            "Snow White: I'm sorry but this isn't working for me.\nSleeping Beauty: It's not like your attitude is helping, Snow.\nSnow White: You're just jealous that I was voted fairest in the land.\nRapunzel: Oh, you mean in that rigged election?\nSnow White: You're one to talk. \"Rapunzel, Rapunzel, let down thy golden extensions.\"\nQueen Lillian: Ladies, let go of your petty complaints and let's work together.",
            "Puss in Boots: [after switching bodies with Donkey] hee haw.\nDonkey: Oh, you'll learn to control that!",
            "Shrek: [after the royal page comes into the bedroom just as he was about to kiss Fiona] Someone had better be dying.\n[cuts to everyone in the King's bedroom]\nKing Harold: I'm dying...",
            "Sleeping Beauty: Who dat?",
            "Guinevere: Ahem. This is like totally embarrassing, but my friend Tiffany thinkest thou vex her so soothly and she thought perchance thou would want to ask her to the homecoming dance or something.\nShrek: Excuse me?\nGuinevere: It's like whatever. She's just totally into college guys and mythical creatures and stuff.",
            "Captain Hook: [looming over a young boy threateningly with his hook] Well, well, Peter Pan!\nMother: His name's not Peter!\nCaptain Hook: Shut it, Wendy.",
            "Puss in Boots: If he were real, could I do this?\n[Digs claws into Shrek's leg, Shrek tries to hold in his pain]\nShrek: Ah! Oww!\nDonkey: Or this?\n[Kicks Shrek's other leg, Shrek moans]\nShrek: If it were real, that would have been agonizingly painful.\nDonkey: Now watch this!\nShrek: [Restrains Donkey and Puss] That's quite enough, boys!",
            "Donkey: [Hook's men wheel his piano in during the fight] Look out! They got a piano!",
            "Shrek: Excuse me can you ladies tell me where to find...\nGuinevere: Ugh, totally ew-eth.\nTiffany: Totally.",
            "Donkey: [Donkey and Puss in Boots have switched bodies] I've been abra-cadabra'd into a Fancy Feasting second-rate sidekick!\nPuss in Boots: At least you don't look like a bloated roadside piñata. You really need to go on a diet.\nDonkey: And you really need to get yourself a pair of pants! I feel all exposed and nasty!",
            "Donkey: [seeing Shrek naked in the bed] Aahh! You know, you really need to get yourself a pair of jammies!",
            "Puss in Boots: [after Shrek throws Donkey out the door] Some people just don't understand boundaries.\n[Shrek then throws Puss out. Puss does his cat screech, then the eyes]",
            "Puss in Boots: [Puss says to Shrek as the ship leaves] Well my friend, you are royally...\n[loud horn blast]",
            "Queen Lillian: Hi-yah!\n[smashes wall with her head]\nPrincess Fiona: Mom.\nQueen Lillian: What? You didn't think you inherited your fighting skills from your father?",
            "Artie: [convincing Merlin to help them get back to Far Far Away]\n[weeping like a troubled teen]\nArtie: It's just so hard, you know? They really need to get back, 'cause their kingdom's in trouble, 'cause there's a really bad man... and it's just so hard!\nMerlin: Come on, take it easy!\nArtie: No! I don't think you understand!\n[collapses at Merlin's feet]\nArtie: There's a mean person doing mean things to good people\nShrek: Oh, have a heart, old man\nArtie: And they really need your help to get them back! So why won't you help them?\n[collapses and sobs inaudibly]\nMerlin: [awkwardly] Oh, ok... Um, I'll go and get my things\nArtie: [stands up and clears his throat]\n[to Shrek]\nArtie: Piece of cake.",
            "Merlin: [meditating] I'm a buzzing bee... buzz, buzz, buzz...\nArtie: Mr. Merlin? They...\n[gestures to Shrek and crew, but stops short]\nArtie: ... *we* really need your help. Do you think you can use your magic to transport us to...\nMerlin: [interrupting] Sorry, kid, I don't do that stuff anymore. How about a hug? That's the best kind of magic there is!",
            "Donkey: What in the shestershire is this place?\nShrek: Well, my stomach's aching and my palms just got sweaty. Must be a high school.",
            "Princess Fiona: [after learning that Rapunzel is dating Prince Charming] Rapunzel! How could you?\nRapunzel: Jealous, much?",
            "Shrek: Good morning.\nPrincess Fiona: Good morning. Ooh, morning breath.\nShrek: Yeah. Isn't it wonderful?",
            "Shrek: Good morning.\nPrincess Fiona: Good morning. Ooh, morning breath.\nShrek: Yeah. Isn't it wonderfulShrek: And if he gives me any trouble, I can always use reason and persuasion.\n[Lifts up left fist]\nShrek: Here's reason...\n[Lifts up right fist]\nShrek: ... and here's persuasion.",
            "Ship Captain: [in a menacing growl] You're finished.\n[Shrek, Puss in Boots, and Donkey turn and stare]\nShip Captain: [apologetically] Heh... with your journey.\n[points to land]",
            "Gingy: [At Fiona's baby shower, giving her a baby carrier] The baby's gonna love it because I do!",
            "Artie: You know, Shrek, you're all right. You just need to do a little less yelling, and use more soap.\nShrek: Thanks, Artie.\nArtie: The soap is because you stink. Really bad.\nShrek: Yeah, I got that.",
            "Puss in Boots: [talking to a female kitten] It's out of my hands, senorita. The winds of fate have blown on my destiny. But I will never forget you. You are the love of my life.\nFemale kitty cat: Meeaow.\nPuss in Boots: [to several kitty cats] As are you... And, uh, you... And, oops, you... And I... err... I don't know you but I'd like to.\nA bunch of female kitty cats: Meeaow.\nPuss in Boots: I gotta go!",
            "Evil Tree #2: That's easy for you to say! You're not a haunted tree!\nEvil Tree #1: I think what Steve is trying to say is that it's not easy to come by honest work when the whole world is against you.\nEvil Tree #2: Yes! Thank you, Ed!",
            "Sleeping Beauty: Everything always about you, it's not like your additude is helping Snow.\nSnow White: Well maybe it just bothers you that I was voted fairest in the land.",
            "Shrek: [to Charming] Those are some nice leotards, though\nPrince Charming: Oh, thank you.\nShrek: Do they have those in men's sizes?\n[audience laughs]",
            "Artie: And so, people, I hope you enjoy your stay in prison, while I rule the free world, baby!\nShrek: All right, don't overdo it.\nArtie: I'm building my city, people, on rock 'n' roll!\nShrek: You just overdid it.",
            "Shrek: Break a leg. On second thought, let me break it for you.",
            "Donkey: [Having just fallen from the sky] I haven't had a trip that bad since college!",
            "Artie: Please don't eat me.\nCrowd: Eat him! Eat him!...\nShrek: I'm not here to eat him.\nCrowd: [Disappointed] Aww!",
            "Gingy: [to Prince Charming] The only thing you're ever gonna be king of, is king of the stupids!",
            "Puss in Boots: The Frog King is dead.",
            "Artie: If there's something you want to do, or someone you really want to be, then the only one standing in your way... is you.\nRumplestiltskin: Me?\nGuard #1: Get him, lads!",
            "Headless Horseman: I've always wanted to play the flute.",
            "Girl: I'd rather get the black plague and lock myself in an iron maiden than go out with him.",
            "Shrek: Fiona, try to be reasonable. Have you seen a baby lately? All they do is eat and poop, and then they cry, and they cry when they poop, and poop when they cry. Now imagine an *ogre* baby. They extra cry, and they extra poop.",
            "Cinderella: [whispering to Fiona about her present] It's for the poopies!\nSleeping Beauty: Ew! Wait, babies poop?\nRapunzel: Everybody poops, Beauty!",
            "Doris: I know he's a jerk and everything but I gotta admit that Charming makes me hotter than July.\nSleeping Beauty, Rapunzel: Ewww!",
            "Donkey: [to Shrek and Fiona] Good Morning, good morning... To you, and you and youuuuu.",
            "Puss in Boots: I don't know you, but I'd like to.",
            "[student stumbles out of trailer]\nStudent: Dude, don't burn all my Frankincense and Myrrh.",
            "Merlin: Can I interest anyone in a snack or beverage?",
            "[first lines]\nPrince Charming: Onward, Chauncey! To the highest room of the tallest tower, where my princess awaits rescue by the handsome Prince Charming!",
            "Gingerbread Man: Ew! This is worse than Love Letters. I hate dinner theater.\nPinocchio: Me too.\n[his nose grows]",
            "Donkey: They grow up so fast.\nShrek: Not fast enough.",
            "Artie: Did you say you were looking for Arthur?\nPuss in Boots: That information is on a need to know basis.\nDonkey: It's top secret. Hushity-hush.",
            "Mabel: What do you want, Charming?\nPrince Charming: Oh, not much. Just a chance at redemption... and a fuzzy navel.",
            "Shrek: If Artie trusts him, I trust him, even *if* his cloak doesn't completely cover his...",
            "Merlin: Greetings, cosmic children of the universe. Welcome to my serenity circle. Please leave all bad vibes outside the healing vortex.",
            "Merlin: Now, look into the fire and tell me what you see.\nDonkey: Ooh, charades! Okay, I see a Dutch fudge torte with cinnamon swirls!\nMerlin: Okay, monster. Go for it.\n[Shrek looks into the smoke, sees a baby carriage; tries to blow it away]\nShrek: Uh... I see a rainbow pony.",
            "Lancelot: Artie a King? More like mayor of Loserville.",
            "Shrek: [to Artie shortly after they crash the boat] If you think this is getting you out of anything, well it isn't! We're heading back to Far Far Away one way or another! And you're gonna be a father!\nArtie: [Sounding confused] What?\nDonkey: [to Shrek] You just said father!\nShrek: [to Artie] I said... king, you're gonna be king!\nArtie: [Imitating Shrek] You're gonna be king!\n[Reverts back to his normal voice]\nArtie: Yeah, right!",
            "Prince Charming: I am the rightful King of Far Far Away!",
            "Prince Charming: This was supposed to be *my* Happily Ever After!\nShrek: Well, I guess you need to keep looking, because I'm not giving up mine.",
            "Doris: [while distracting the enemy guards] Hey! How's it going?",
            "Puss in Boots: We've got to save her!\nDonkey: But she's so far, far away!",
            "Princess Fiona: Hi honey. Sorry we're late. You okay?\nShrek: Much better, now that you're here.",
            "Shrek: That's right, I'm the new mascot. So let's really try and beat the other guys at whatever it is they are doing!",
            "Princess Fiona: [feeling her stomach] Shrek!\nShrek: [calling out to her] Yeah?\nPrincess Fiona: Wait!\nShrek: What is it?\nPrincess Fiona: [taking a deep breath] I'm... I'm...\n[but was cut off by the ship captain's fog horn]\nShrek: [laughs] I love you too, honey!\nPrincess Fiona: No! No, I said I'm-\n[cut off by the fog horn again]\nShrek: [grabs the fog horn from the captain, and throws it overboard] You're what?\nPrincess Fiona: I said I'm pregnant!\n[the fairytale creatures cheer]\nShrek: [can't believe his ears] Oh... what was that?\nPrincess Fiona: You're going to be a father!\nShrek: [nervous laugh] That's great.\nPrincess Fiona: Really? I'm glad you think so! I love you!\nShrek: [smiles back at Fiona] Yeah...\n[nervous laugh]\nShrek: Me, too.",
            "Princess Fiona: Okay, girls, from here on out, we're gonna take care of business ourselves.",
            "Puss in Boots: Okay, peoples. This isn't a rehearsal. Let's see some hustle!\nDonkey: Smiles, everyone! Smiles!",
            "King Harold: [coughs] I'm dying...\nQueen Lillian: Harold.\nKing Harold: Don't forget to pay the gardener, Lillian.\nQueen Lillian: Of course, darling.\nKing Harold: Fiona...\nPrincess Fiona: Yes, Daddy?\nKing Harold: I know I made many mistakes with you.\nPrincess Fiona: It's okay.\nKing Harold: But your love for Shrek has taught me so much.\n[to Shrek]\nKing Harold: My dear boy, I'm proud to call you my son.\nShrek: And I'm proud to call you my Frog... King dad-in-law.",
            "Cinderella: Oh, Fiona, won't you please open mine first? It's the one in front.\nPrincess Fiona: [reads the card] \"Congratulations on your new mess maker...\" oh, 'mess maker.'\n[laughs]\nPrincess Fiona: \"Hopefully this helps. Love, Cinderella.\"",
            "[at Fiona's baby shower, a group of birds gently place a flowered wreath on Fiona's head]\nCinderella: Stunning.\nSnow White: Look at you.\nRapunzel: Wow.\nSnow White: Look you darling.\nSleeping Beauty: Just precious. Look at her.\nRapunzel: So, have you had any cravings since you've been pregnant?\nPrincess Fiona: [with her mouth full of cake] No, not at all.\n[sniffs]\nPrincess Fiona: Do you smell ham?",
            "Shrek: I don't know how much longer I can keep this up Fiona.\nPrincess Fiona: I'm sorry, Shrek, but can you please just try to grin and bear it? It's just until Dad gets better.\n[Shrek lets out another frustrated sigh]\nPrincess Fiona: Shrek?\nShrek: Yeah.\nPrincess Fiona: You look handsome.\nShrek: Ah. Come here, you.\n[she gives him a supportive smile. He relaxes and smiles back. Fiona puckers up her lips and he leans in for a kiss, but their bulky outfits prevent it. They let out a huge breath of air]\nShrek: Oh, my butt is itching up a storm and I can't reach it in this monkey suit.",
            "Princess Fiona: Just think... a couple more days and we'll be back home in our vermin-filled shack, strewn with fungus, filling with the rotting stench of mud and neglect.\nShrek: Oh, you had me at \"vermin-filled\".\nPrincess Fiona: And, uh.. maybe even the pitter-patter of little feet on the floor?\nShrek: [laughs] That's right. The swamp rats are spawning.\nPrincess Fiona: Uh, no... you know, what I was thinking of is a little bigger then a swamp rat.\nShrek: Donkey?\nPrincess Fiona: No, Shrek. Um... what if..\nShrek: Yeah?\nPrincess Fiona: They were little ogre feet.",
            "Snow White: [in sing-song voice] It's present time!",
            "Queen Lillian: Ladies, let go of your petty complaints and let's work together.",
            "Snow White: So I guess the plan is we just wander aimlessly in this stinkhole until we rot.\nPrincess Fiona: No, we're gonna get inside and find out what Charming's up to.",
            "Princess Fiona: [turns to Snow White's present] Who's this one from?\nSnow White: I got you the biggest one because I love you the most.\nPrincess Fiona: [reads the card] \"Have one on me. Love, Snow White.\"\n[she pulls the string, opening the box to reveal a dwarf]\nPrincess Fiona: \"Um, what is it?\nSnow White: [laughs] He's a live-in babysitter.\nNanny Dwarf: Where's the baby?\nPrincess Fiona: You're too kind, Snow, but I can't accept this.\nSnow White: Think nothing of it. I've got six more at home.\nPrincess Fiona: What does he do?\nCinderella: The cleaning.\nSnow White: The feeding.\nNanny Dwarf: The burping.",
            "Princess Fiona: What are Shrek and I supposed to do?\nRapunzel: Well, now you'll have plenty of time to work on your marriage.\nPrincess Fiona: Gee, thanks Rapunzel, and what's that suppose to mean?\nRapunzel: Oh, come on now, Fiona. You know what happens.\n[Cinderella prods Sleeping Beauty]\nSleeping Beauty: [wakes up] Huh? You're tired all the time.\nSnow White: You'll start letting yourself go.\nGingy: Stretch marks.\nRapunzel: Say goodbye to romance.\n[Dragon nods in agreement]\nPrincess Fiona: Um sorry... but how many of you have kids?\nDoris: She's right. A baby is only gonna strengthen the love that Shrek and Fiona have. How did Shrek react when you told him? Tell me!\nPrincess Fiona: Well, when he first found out, Shrek said...\n[get interrupted when Dragon alerts them]",
            "Queen Lillian: Excuse me. Old lady coming through.",
            "Snow White: [pacing back and forth] Have we had just stayed put like I suggested, we could be sipping tea out of little heart-shaped cups...\nCinderella: [scrubbing the floor] Yeah... yeah, heart-shaped cups.\nSnow White: And eating crumpets smothered with loganberries.\nCinderella: Yeah... loganberries.\nSnow White: [stops pacing] Shut up, Cindy.\nCinderella: Yeah, shut up.\nCinderella's Reflection: No, *you* shut up.\nCinderella: Just stay out of this.\nSnow White: Who cares who's \"running the kingdom\" anyway?\nPrincess Fiona: *I* care.\nQueen Lillian: And you all should care, too.",
            "Cinderella: [walking through the sewers] Oh, this place is filthy. I feel like a hobo.",
            "Snow White: Everybody stay calm. We're all gonna die!",
            "Shrek: Oh, Arthur! Come out, come out wherever your are!\n[a thud is heard twice, Donkey angrily bursts out of the locker]\nDonkey: Yeah, you better run, you little punk no-goodniks! 'Cause the days of little Donkey Dumpy Drawers are over!"
        ],
        "top_cast": [
            {
                "name": "Mike Myers",
                "characters": [
                    "Shrek"
                ]
            },
            {
                "name": "Eddie Murphy",
                "characters": [
                    "Donkey"
                ]
            },
            {
                "name": "Cameron Diaz",
                "characters": [
                    "Princess Fiona"
                ]
            },
            {
                "name": "Antonio Banderas",
                "characters": [
                    "Puss in Boots"
                ]
            },
            {
                "name": "Julie Andrews",
                "characters": [
                    "Queen"
                ]
            },
            {
                "name": "John Cleese",
                "characters": [
                    "King"
                ]
            },
            {
                "name": "Rupert Everett",
                "characters": [
                    "Prince Charming"
                ]
            },
            {
                "name": "Eric Idle",
                "characters": [
                    "Merlin"
                ]
            },
            {
                "name": "Justin Timberlake",
                "characters": [
                    "Artie"
                ]
            },
            {
                "name": "Susanne Blakeslee",
                "characters": [
                    "Evil Queen"
                ]
            },
            {
                "name": "Cody Cameron",
                "characters": [
                    "Pinocchio",
                    "Three Pigs"
                ]
            },
            {
                "name": "Larry King",
                "characters": [
                    "Doris"
                ]
            },
            {
                "name": "Christopher Knights",
                "characters": [
                    "Blind Mice",
                    "Heckler",
                    "Evil Tree #2",
                    "Guard #2"
                ]
            },
            {
                "name": "John Krasinski",
                "characters": [
                    "Lancelot"
                ]
            },
            {
                "name": "Ian McShane",
                "characters": [
                    "Captain Hook"
                ]
            },
            {
                "name": "Cheri Oteri",
                "characters": [
                    "Sleeping Beauty",
                    "Actress"
                ]
            },
            {
                "name": "Regis Philbin",
                "characters": [
                    "Mabel"
                ]
            },
            {
                "name": "Amy Poehler",
                "characters": [
                    "Snow White"
                ]
            },
            {
                "name": "Seth Rogen",
                "characters": [
                    "Ship Captain"
                ]
            },
            {
                "name": "Maya Rudolph",
                "characters": [
                    "Rapunzel"
                ]
            },
            {
                "name": "Amy Sedaris",
                "characters": [
                    "Cinderella"
                ]
            },
            {
                "name": "Conrad Vernon",
                "characters": [
                    "Gingerbread Man",
                    "Rumplestiltskin",
                    "Headless Horseman"
                ]
            },
            {
                "name": "Aron Warner",
                "characters": [
                    "Wolf"
                ]
            },
            {
                "name": "Jasper Johannes Andrews",
                "characters": [
                    "Ogre Baby"
                ]
            },
            {
                "name": "Guillaume Aretos",
                "characters": [
                    "Raul"
                ]
            },
            {
                "name": "Kelly Asbury",
                "characters": [
                    "Master of Ceremonies",
                    "Fiddlesworth"
                ]
            },
            {
                "name": "Zachary James Bernard",
                "characters": [
                    "Ogre Baby"
                ]
            },
            {
                "name": "Andrew Birch",
                "characters": [
                    "Evil Tree #1"
                ]
            },
            {
                "name": "Sean Bishop",
                "characters": [
                    "Drivers Ed Instructor",
                    "Hall Monitor",
                    "Teacher"
                ]
            },
            {
                "name": "Kelly Cooney Cilella",
                "characters": [
                    "Cheerleader",
                    "Tiffany",
                    "Mother"
                ]
            },
            {
                "name": "Walt Dohrn",
                "characters": [
                    "Van Student",
                    "Xavier",
                    "Principal Pynchley",
                    "Nanny Dwarf",
                    "Evil Knight",
                    "Singing Villain"
                ]
            },
            {
                "name": "Dante James Hauser",
                "characters": [
                    "Ogre Baby"
                ]
            },
            {
                "name": "Jordan Alexander Hauser",
                "characters": [
                    "Ogre Baby"
                ]
            },
            {
                "name": "Tom Kane",
                "characters": [
                    "Guard #1"
                ]
            },
            {
                "name": "Tom McGrath",
                "characters": [
                    "Gary"
                ]
            },
            {
                "name": "Chris Miller",
                "characters": [
                    "Puppet Master",
                    "Announcer",
                    "Mascot",
                    "Singing Villain"
                ]
            },
            {
                "name": "Latifa Ouaou",
                "characters": [
                    "Cheerleader",
                    "Guinevere",
                    "Woman"
                ]
            },
            {
                "name": "Alina Phelan",
                "characters": [
                    "Cheerleader"
                ]
            },
            {
                "name": "David P. Smith",
                "characters": [
                    "Waiter",
                    "Evil Dwarf"
                ]
            },
            {
                "name": "Mark Valley",
                "characters": [
                    "Cyclops"
                ]
            },
            {
                "name": "Kari Wahlgren",
                "characters": [
                    "Old Lady"
                ]
            }
        ]
    },
    "shrek_forever_after": {
        "id": 3,
        "key": "shrek_forever_after",
        "name": "Shrek Forever After",
        "year": 2010,
        "quotes": [
            "Donkey: Man, you are a cat-tastrophe.\nPuss in Boots: And you, are ri-donk-ulous.\n[Both laugh]",
            "Butterpants: Do the roar!",
            "Shrek: [to Fiona; while disappearing since his \"day\" is almost over] You know what the best part of today was? I got the chance to fall in love with you all over again.",
            "Shrek: You know, I always thought I'd rescued you from the Dragon's Keep.\nPrincess Fiona: You did.\nShrek: No. It was you who rescued me.",
            "Shrek: Fiona, I know everything about you, I know you sing so beautifully that birds explode. I know that when you sign your name, you put a heart over the i. I know that when you see a shooting star you cross your fingers on both hands, squinch up your nose, and you make a wish, I know that you don't like the covers wrapped around your feet, and I know that you sleep by candlelight because every time you close your eyes, you're afraid you're going to wake up back in that tower, But most importantly Fiona, I know that the reason that you turn human every day is because you've never been kissed, well, by me.",
            "Princess Fiona: And when the smoke clears... Wait, what's this?\nCookie: That's my chimichanga stand.\nPrincess Fiona: Um, no, Cookie. We won't be needing that.\nCookie: Trust me, Fiona. Y'all gonna be really hungry after this ambush, OK? Now go and finish your little speech.",
            "Donkey: Are my kids cute or do they make people uncomfortable?",
            "Shrek: Okay, I know you don't remember me but we're married, and at the birthday party with some pigs and a puppet, the villagers wanted me to sign their pitchforks and this boy kept saying 'do the roar! do the roar!' Then I punched the cake that the pigs ate, and the next thing I knew, my donkey fell in your waffle hole.",
            "Shrek: [upon seeing the obese Puss] Puss, what happened to you? You got so fa...\n[Puss gives a stinky look]\nShrek: fa... ncy!\nPuss in Boots: Do I know you?\nShrek: Where's your hat? Where's your belt? Your wee little boots?\nPuss in Boots: Boots? For a cat? Ha!\nShrek: But you're Puss in Boots.\nPuss in Boots: Maybe once. But that is a name I have outgrown.\nShrek: That's not the only thing you've outgrown.\nPuss in Boots: Hey! I may have let myself go a little since my retirement, but hanging up my sword was the best decision of my life. I have all the cream I can drink and all the mice I can chase.\n[a mouse runs up and drinks from Puss' bowl]\nPuss in Boots: Eh. I'll get him later.",
            "Donkey: Help! I'm being assnapped!",
            "Shrek: There's a stack of freshly made waffles in the middle of the forest! Don't you find that a wee bit suspicious?",
            "[Rumpelstiltskin licks a plate from the garbage; Shrek storms outside; Fiona follows him; Rumpelstiltskin hides behind a barrel]\nPrincess Fiona: Unbelievable.\nShrek: Tell me about it! Those villagers--!\nPrincess Fiona: I'm not talking about the villagers, Shrek. I'm talking about you. Is this *really* how you want to remember the kids' first birthday?\nShrek: Oh, great, so this is all *my* fault?\nPrincess Fiona: Yes! But, you know what? Let's talk about this *after* the party, at home.\nShrek: You mean that roadside attraction we live in? \"Step right up! See the dancing ogre! Don't worry, he won't bite!\" I *used* to be an ogre! Now, I'm just a jolly green joke!\nPrincess Fiona: OK, OK, maybe you're not... the ogre you used to be, but maybe that's not such a bad thing.\nShrek: Ah, I wouldn't expect *you* to understand. It's not like you're a *real* ogre. You spent half your life in a palace.\nPrincess Fiona: And the other half locked away in a tower.\nShrek: [sighs] Look, all I want is for things to go back to the way they used to be. Back when villagers were afraid of me and I could take a mud bath in peace! When I could do what I wanted, when I wanted to do it! Back when the world made sense!\nPrincess Fiona: You mean, back before you rescued me from the Dragon's Keep?\nShrek: Exactly!\nPrincess Fiona: [stares at Shrek in shock] Shrek. You have three beautiful children. A wife who loves you. Friends who adore you. You have everything. Why is it the only person who can't see that is you?\n[opens the door, looks back at Shrek, shakes her head and goes inside]\nShrek: That's just great.\n[marches off; Rumpelstiltskin comes out of hiding and smiles evilly]",
            "Puss in Boots: Feed me, if you dare.",
            "Donkey: And I thought the waffle fairy was just a bedtime story!",
            "Shrek: Sorry, but this order's to go.\nCookie: But I haven't taken out his gibblets yet.\nShrek: Trust me, you don't want to eat this one.\nDonkey: I go down smooth, but I come out fightin'!",
            "Brogan: Welcome to the Resistance, brother.\nShrek: Resistance?\nBrogan: We fight for justice, and for oppressed ogres everywhere!\n[Holds his nose and blows, and his ears trumpet; the other ogres follow suit]\nShrek: I didn't know we could do that.",
            "Donkey: Why don't you just tell her what you told me? You know, about how you're her true love and you came from an alternate universe.\nShrek: Oh, and while I'm at it, why don't I tell her that you're married to a fire-breathing dragon and you have little mutant donkey dragon babies?\nDonkey: I do?\nShrek: You saw what happened. She's going to think I'm crazy.\nDonkey: I'm a daddy?",
            "Rumpelstiltskin: You're not going to eat me?\nShrek: I already had a big bowl of curly-toed weirdo for breakfast.",
            "Donkey: You know what would pick up the morale in here? Flip-flop Fridays. You can feel the breeze in your toes.",
            "Puss in Boots: I am not believing what I have just witnessed. Back there, you and Fiona. There was a spark; a spark inside her heart I thought was long extinguished. It was as if, for one moment, Fiona had actually found her true love!\nShrek: I am her true love. I ended her curse.\nPuss in Boots: You know of her curse?\nShrek: \"By day, one way, by night another. This shall be the norm. Until you find true love's first kiss and then take love's true form.\"\nPuss in Boots: You even know the little rhyme! It is true! You are the one! You must prove it to her!\nShrek: How?\nPuss in Boots: Convince her! Go to her when she's alone and tell her something that only her true love would know.\nDonkey: [popping out of his hiding spot] Know about what?\n[startled, Puss jumps back and hisses]\nDonkey: Whoo, that's a whole lot of kitty! Shrek, can we keep him?",
            "Rumpelstiltskin: I got to say, Shrek, I envy you. To live the life of an ogre; no worries, no responsibilities. You are free to pillage and terrorize as you please.\nShrek: Free? Oh, that's a laugh.\nRumpelstiltskin: Oh, yeah?\nShrek: Sometimes I wish I had just one day to feel like a real ogre again.\nRumpelstiltskin: Well, why didn't you say so? Magical transactions are my specialty!",
            "Pinocchio: [Rumpelstiltskin tore out pages of a book] Uh, sir? You're gonna have to pay for that.\nRumpelstiltskin: Um, m-m-maybe we can make a deal for it, little boy?\nPinocchio: Oh, I'm not a real boy.\nRumpelstiltskin: [smiling wickedly] Do you want to be?\n[gets evicted from the library]\nPinocchio: Nobody needs YOUR deals anymore, Grumpel Stinkypants!\nRumpelstiltskin: [glares at a torn page with Shrek on it, lividly] I wish that ogre was never born!",
            "Donkey: I'm a daddy?",
            "Donkey: Please eat my face last and send my hooves to my momma!",
            "Rumpelstiltskin: Nobody's smart but me!",
            "Butterpants: Do the roar!\nShrek: [unenthusiastically] Roar.\nButterpants: I don't like it.",
            "Shrek: [learning there's a way to void his deal with Rumpel] Donkey, I've read the fine print and there's nothing about an exit clause in here.\nDonkey: Well, you didn't expect him to make it easy for you. Here, let me show you how it's done. I didn't spend all that time around them witches without picking up a few tricks. Your tiny little ogre brain couldn't begin to comprehend the complexity of my polygonic foldability skills.\nShrek: What are you doing?\nDonkey: Hey, I can't get my origami on unless you back off. Thank you.\n[folding the contract over itself]\nDonkey: Okay, here's what you got to do. You got to fold this piece here... make this letter match up here... and bring this corner here like this... and if you do it just right, it will show you what to do. There!\n[showing him the finished product]\nDonkey: \"Try Lou's Bliss.\"\n[awkward silence]\nDonkey: Man, who's Lou?\nShrek: Give me that!\n[re-folding it]\nShrek: \"True love's kiss.\"\nDonkey: [looking at him suspiciously] Hey. Boy, you gonna have to take me to dinner first.",
            "Rumpelstiltskin: I don't know, not much of a storybook ending. The noble Shrek turns himself in to save a bunch of filthy ogres.\nShrek: All that matters is that they're free and Fiona is safe.\nRumpelstiltskin: Aw, I bet Fiona would be really touched to hear that. But, hey... I guess you can tell her yourself.\nShrek: [seeing her chained up] Fiona! Stiltskin, we had a deal! You agreed to free all ogres!\nRumpelstiltskin: Oh, yeah. But Fiona isn't all ogre, is she? \"By day, one way, by night, another.\" Blardy, blardy, blar.",
            "Shrek: So what day *would* I have to give up?\nRumpelstiltskin: [carving a rat] Oh, I don't know, any day. A day from your past. How about the day you had the flu? A day you lost a pet?\n[resentfully and faster]\nRumpelstiltskin: A day some meddling oaf stuck his big nose where it didn't belong, destroying your business and ruining your life?\n[the knife shatters the plate, calming down]\nRumpelstiltskin: Just for an example.",
            "Donkey: Put a little mustard on mine, Captain Crazy!",
            "Donkey: Yeah! Waffles! And I thought the Waffle Fairy was just a bedtime story! Sticky stacks of golden syrupy deliciousness!\nShrek: Donkey! Don't eat that!\n[Donkey groans]\nShrek: There's a stack of freshly made waffles in the middle of the forest. Don't you find that a wee bit suspicious?",
            "Shrek: If I didn't save Fiona... then who did?",
            "Shrek: [after an attempt to break Rumpel's curse doesn't work] I don't understand. This doesn't make any sense. True love's kiss was supposed to fix everything!\nPrincess Fiona: Yeah, you know what? That's what they told me, too. True love didn't get me out of that tower. I did. I saved myself. Don't you get it? It's all just a big fairy tale.\nShrek: Fiona, don't say that. It does exist!\nPrincess Fiona: And how would you know? Did you grow up locked away in a dragon's keep? Did you live all alone in a miserable tower? Did you cry yourself to sleep every night waiting for a true love that never came?\nShrek: But... but I'm your true love.\nPrincess Fiona: Then where were you when I needed you?\nDonkey: [Fiona leaves] Maybe you kissed her wrong?\nShrek: No. The kiss didn't work... because Fiona doesn't love me.",
            "Donkey: I've never seen an ogre cry.\nShrek: I'm not crying.\nDonkey: It's nothing to be ashamed of. I mean, I cry all the time. Just thinking about my grandma, or thinking about baby kittens, or... or my grandma kissing a baby kitten... or a little baby grandma kitten.\n[tearing up and sobbing]",
            "Shrek: I was tricked into signing something I shouldn't have.\nDonkey: Oh, you signed up for one of them time-shares, huh?",
            "Shrek: [figuring out how to break his contract with Rumpel] If Fiona and I share true love's kiss, I will get my life back!\nDonkey: [jumping out of his arms] Okay! This isn't a petting zoo! So where is this Fiona?\nShrek: Well, that's just it, you see. I don't know.\nDonkey: You know, when I lose something, I always try to retrace my steps. So, uh, where did you leave her last?\nShrek: The last time I saw her... I told her I wished I'd never rescued her.\n[realizing where she is]\nShrek: Oh, no.\nDonkey: [cut to them approaching the castle] Shrek? Shrek! Shrek, no, wait! Wait, Shrek! What, are you crazy? That's the Dragon's Keep! They keep dragons in there!",
            "Shrek: You witches are making a BIG MISTAKE! I've known my rights!\nPumpkin Witch: You have the right to SHUT YOUR MOUTH!\n[throws a pumpkin at Shrek's mouth]",
            "Rumpelstiltskin: [rolls out a contract] As you can see, everything's in order.\nKing: So you'll put an end... to our daughter's curse?\nRumpelstiltskin: And in return, you sign the kingdom of Far, Far Away over to me.\n[thunder and lightning flash outside; Harold gasps; Fifi hisses; Harold turns to his wife]\nKing: Lillian, this is madness!\nQueen: What choice do we have, Harold? Fiona has been locked away in that tower far too long.\nRumpelstiltskin: It's not like she's, uh, getting any younger.\nKing: But to sign over our entire kingdom?\nRumpelstiltskin: [slowly slides the contract away] Well, if your kingdom's worth more to you than your daughter...\nKing: [slams his open palm down onto the contract] Nothing! Is worth more to us than our daughter.",
            "Rumpelstiltskin: [narrating] Once upon a time a long time ago, a king and a queen had a beautiful daughter named Fiona. But she was possessed by a terrible curse. By day, a lovely princess; by night, a hideous ogre. Only true love's kiss would lift her curse. So Fiona waited in a tower, guarded by a dragon, until the day when her true love would arrive. But as the days turned into years, the King and Queen were forced to resort to more desperate measures.",
            "Donkey: [singing \"Tomorrow\"] Tomorrow , Tomorrow, I love ya tomorrow... .\nShrek: [while Donkey is singing] Donkey, where am I? What's happening?\nWagon Witch #1: Quiet down there! Oh, I hate this song\n[whips Donkey]\nDonkey: [starts singing part of \"Papa don't preach\"] But I made up my mind, I'm keeping my baby...\nWagon Witch #2: Yeah, I'm driving, so, uh, I'm in charge of the music\n[whips Donkey]\nDonkey: Hey, will you witches make up your mind, please?",
            "Cookie: Cookie's bringing the heat out of the kitchen!"
        ],
        "top_cast": [
            {
                "name": "Mike Myers",
                "characters": [
                    "Shrek"
                ]
            },
            {
                "name": "Eddie Murphy",
                "characters": [
                    "Donkey"
                ]
            },
            {
                "name": "Cameron Diaz",
                "characters": [
                    "Princess Fiona"
                ]
            },
            {
                "name": "Antonio Banderas",
                "characters": [
                    "Puss in Boots"
                ]
            },
            {
                "name": "Julie Andrews",
                "characters": [
                    "Queen"
                ]
            },
            {
                "name": "Jon Hamm",
                "characters": [
                    "Brogan"
                ]
            },
            {
                "name": "John Cleese",
                "characters": [
                    "King"
                ]
            },
            {
                "name": "Walt Dohrn",
                "characters": [
                    "Rumpelstiltskin",
                    "Priest",
                    "Krekraw Ogre"
                ]
            },
            {
                "name": "Jane Lynch",
                "characters": [
                    "Gretched"
                ]
            },
            {
                "name": "Craig Robinson",
                "characters": [
                    "Cookie"
                ]
            },
            {
                "name": "Lake Bell",
                "characters": [
                    "Patrol Witch",
                    "Wagon Witch #2"
                ]
            },
            {
                "name": "Kathy Griffin",
                "characters": [
                    "Dancing Witch",
                    "Wagon Witch #1"
                ]
            },
            {
                "name": "Mary Kay Place",
                "characters": [
                    "Guard Witch"
                ]
            },
            {
                "name": "Kristen Schaal",
                "characters": [
                    "Pumpkin Witch",
                    "Palace Witch"
                ]
            },
            {
                "name": "Meredith Vieira",
                "characters": [
                    "Broomsy Witch"
                ]
            },
            {
                "name": "Ryan Seacrest",
                "characters": [
                    "Father of Butter Pants"
                ]
            },
            {
                "name": "Cody Cameron",
                "characters": [
                    "Pinocchio",
                    "Three Pigs"
                ]
            },
            {
                "name": "Larry King",
                "characters": [
                    "Doris"
                ]
            },
            {
                "name": "Regis Philbin",
                "characters": [
                    "Mabel"
                ]
            },
            {
                "name": "Christopher Knights",
                "characters": [
                    "Blind Mice"
                ]
            },
            {
                "name": "Conrad Vernon",
                "characters": [
                    "Gingerbread Man"
                ]
            },
            {
                "name": "Aron Warner",
                "characters": [
                    "Wolf"
                ]
            },
            {
                "name": "Jasper Johannes Andrews",
                "characters": [
                    "Ogre Baby"
                ]
            },
            {
                "name": "Ollie Mitchell",
                "characters": [
                    "Ogre Baby"
                ]
            },
            {
                "name": "Miles Bakshi",
                "characters": [
                    "Ogre Baby",
                    "Villager Kid (as Miles Christopher Bakshi)"
                ]
            },
            {
                "name": "Nina Zoe Bakshi",
                "characters": [
                    "Ogre Baby",
                    "Tourist Girl",
                    "Villager Girl"
                ]
            },
            {
                "name": "Billie Hayes",
                "characters": [
                    "Cackling Witch"
                ]
            },
            {
                "name": "Jeremy Hollingworth",
                "characters": [
                    "Villager Fan #1"
                ]
            },
            {
                "name": "Brian Hopkins",
                "characters": [
                    "Villager Fan #3",
                    "Ogre Gnimrach"
                ]
            },
            {
                "name": "Chris Miller",
                "characters": [
                    "Royal Messenger",
                    "Magic Mirror",
                    "Geppetto"
                ]
            },
            {
                "name": "Mike Mitchell",
                "characters": [
                    "Tour Guide",
                    "Camp Ogre",
                    "Ogre Naysayer",
                    "Baba Witch",
                    "Melty Witch",
                    "Witch Guard #2",
                    "Butter Pants"
                ]
            },
            {
                "name": "James Ryan",
                "characters": [
                    "Villager Fan #2"
                ]
            }
        ]
    },
    "shrek_5": {
        "id": 4,
        "name": "Shrek 5",
        "year": 2026,
        "quotes": [],
        "top_cast": [
            {
                "name": "Cameron Diaz",
                "characters": [
                    "Princess Fiona"
                ]
            },
            {
                "name": "Eddie Murphy",
                "characters": [
                    "Donkey"
                ]
            },
            {
                "name": "Mike Myers",
                "characters": [
                    "Shrek"
                ]
            }
        ]
    }
}